
Command `make test` exited with code 0.

**Standard output**:
```
pytest --cov \
	--cov-report=term-missing --cov-report=xml  \
	-xvvs infrahouse_toolkit
============================= test session starts ==============================
platform linux -- Python 3.9.5, pytest-7.2.1, pluggy-1.0.0 -- /home/aleks/.virtualenvs/infrahouse-toolkit/bin/python
cachedir: .pytest_cache
rootdir: /mnt/c/Users/aleks/code/infrahouse-toolkit
plugins: cov-4.1.0, timeout-2.1.0
collecting ... collected 75 items

infrahouse_toolkit/aws/tests/config/test_aws_home.py::test_aws_home PASSED
infrahouse_toolkit/aws/tests/config/test_get_account_id.py::test_account_id[default-123] PASSED
infrahouse_toolkit/aws/tests/config/test_get_account_id.py::test_account_id[foo-456] PASSED
infrahouse_toolkit/aws/tests/config/test_profiles.py::test_profiles[-profiles0] PASSED
infrahouse_toolkit/aws/tests/config/test_profiles.py::test_profiles[\n[default]\n-profiles1] PASSED
infrahouse_toolkit/aws/tests/config/test_profiles.py::test_profiles[\n[default]\n[profile foo]\n[other section]\n-profiles2] PASSED
infrahouse_toolkit/cli/ih_plan/cmd_min_permissions/tests/test_min_permissions.py::test_help PASSED
infrahouse_toolkit/cli/ih_plan/cmd_min_permissions/tests/test_min_permissions.py::test_simple ## Existing 0 actions:
[]
## 2 new action(s):
[
    "autoscaling:DescribePolicies",
    "autoscaling:PutScalingPolicy"
]
## Old and new actions together excluding duplicates, 2 in total:
[
    "autoscaling:DescribePolicies",
    "autoscaling:PutScalingPolicy"
]

PASSED
infrahouse_toolkit/cli/ih_plan/cmd_min_permissions/tests/test_min_permissions.py::test_simple_existing ## Existing 1 actions:
[
    "s3:PutBucketVersioning"
]
## 0 new action(s):
[]
## Old and new actions together excluding duplicates, 1 in total:
[
    "s3:PutBucketVersioning"
]

PASSED
infrahouse_toolkit/cli/ih_plan/cmd_min_permissions/tests/actionlist/test_actions.py::test_actions PASSED
infrahouse_toolkit/cli/ih_plan/cmd_min_permissions/tests/actionlist/test_add.py::test_add_sorted PASSED
infrahouse_toolkit/cli/ih_plan/cmd_min_permissions/tests/actionlist/test_add.py::test_add PASSED
infrahouse_toolkit/cli/ih_plan/cmd_min_permissions/tests/actionlist/test_add.py::test_add_with_dependency[autoscaling:CreateAutoScalingGroup-dependent_actions0] PASSED
infrahouse_toolkit/cli/ih_plan/cmd_min_permissions/tests/actionlist/test_add.py::test_add_with_dependency[logs:CreateLogGroup-dependent_actions1] PASSED
infrahouse_toolkit/cli/ih_plan/cmd_min_permissions/tests/actionlist/test_add.py::test_add_with_dependency[lambda:CreateFunction-dependent_actions2] PASSED
infrahouse_toolkit/cli/ih_plan/cmd_min_permissions/tests/actionlist/test_add.py::test_add_with_dependency[s3:PutObject-dependent_actions3] PASSED
infrahouse_toolkit/cli/ih_plan/cmd_min_permissions/tests/actionlist/test_add.py::test_add_with_dependency[events:PutRule-dependent_actions4] PASSED
infrahouse_toolkit/cli/ih_plan/cmd_min_permissions/tests/actionlist/test_add.py::test_add_with_dependency[events:PutTargets-dependent_actions5] PASSED
infrahouse_toolkit/cli/ih_plan/cmd_min_permissions/tests/actionlist/test_add.py::test_add_with_dependency[iam:CreateInstanceProfile-dependent_actions6] PASSED
infrahouse_toolkit/cli/ih_plan/cmd_min_permissions/tests/actionlist/test_add.py::test_add_with_dependency[iam:CreateInstanceProfile-dependent_actions7] PASSED
infrahouse_toolkit/cli/ih_plan/cmd_min_permissions/tests/actionlist/test_add.py::test_add_with_dependency[s3:CreateBucket-dependent_actions8] PASSED
infrahouse_toolkit/cli/ih_plan/cmd_min_permissions/tests/actionlist/test_add.py::test_add_with_rewrite PASSED
infrahouse_toolkit/cli/ih_plan/cmd_min_permissions/tests/actionlist/test_load_from_file.py::test_load_from_file PASSED
infrahouse_toolkit/cli/ih_plan/cmd_min_permissions/tests/actionlist/test_parse_trace.py::test_parse_trace[{"aws.operation": "PutScalingPolicy","aws.service": "Auto Scaling"}-expected_actions0] PASSED
infrahouse_toolkit/cli/ih_plan/cmd_min_permissions/tests/actionlist/test_parse_trace.py::test_parse_trace[{"aws.operation": "DescribePolicies","aws.service": "Auto Scaling"}-expected_actions1] PASSED
infrahouse_toolkit/cli/ih_plan/cmd_min_permissions/tests/actionlist/test_parse_trace.py::test_parse_trace[{"rpc.method": "DescribeLogGroups", "rpc.service": "CloudWatch Logs"}-expected_actions2] PASSED
infrahouse_toolkit/cli/ih_plan/cmd_min_permissions/tests/actionlist/test_parse_trace.py::test_parse_trace[{"rpc.method": "ListTargetsByRule", "rpc.service": "EventBridge"}-expected_actions3] PASSED
infrahouse_toolkit/cli/ih_plan/cmd_min_permissions/tests/actionlist/test_parse_trace.py::test_parse_trace[{"rpc.method": "CompleteMultipartUpload", "rpc.service": "s3"}-expected_actions4] PASSED
infrahouse_toolkit/cli/ih_plan/cmd_min_permissions/tests/actionlist/test_parse_trace.py::test_parse_trace[{"rpc.method": "UploadPart", "rpc.service": "s3"}-expected_actions5] PASSED
infrahouse_toolkit/cli/ih_plan/cmd_min_permissions/tests/actionlist/test_parse_trace.py::test_parse_trace_permissions_map[\n{"aws.operation": "HeadBucket","aws.service": "S3"}\n{"rpc.method": "HeadObject", "rpc.service": "S3"}\n{"aws.operation": "GetBucketAccelerateConfiguration","aws.service": "S3"}\n{"aws.operation": "GetBucketEncryption","aws.service": "S3"}\n{"aws.operation": "GetBucketCors","aws.service": "S3"}\n{"aws.operation": "GetBucketLifecycleConfiguration","aws.service": "S3"}\n{"aws.operation": "GetBucketReplication","aws.service": "S3"}\n{"aws.operation": "GetObjectLockConfiguration","aws.service": "S3"}\n-expected_permissions0] PASSED
infrahouse_toolkit/cli/ih_plan/cmd_min_permissions/tests/actionlist/test_parse_trace.py::test_parse_trace_permissions_map[\n{"rpc.method": "CreateBucket", "rpc.service": "S3"}\n{"rpc.method": "CreateTable", "rpc.service": "DynamoDB"}\n-expected_permissions1] PASSED
infrahouse_toolkit/cli/ih_plan/cmd_min_permissions/tests/actionlist/test_parse_trace.py::test_parse_trace_permissions_map[\n{"aws.operation": "DeletePublicAccessBlock","aws.service": "S3"}\n{"aws.operation": "GetPublicAccessBlock","aws.service": "S3"}\n{"aws.operation": "PutPublicAccessBlock","aws.service": "S3"}\n-expected_permissions2] PASSED
infrahouse_toolkit/cli/ih_plan/cmd_min_permissions/tests/actionlist/test_parse_trace.py::test_parse_trace_permissions_map[\n{"tf_resource_type": "aws_s3_bucket_versioning","tf_rpc": "ApplyResourceChange"}\n{"tf_resource_type": "aws_s3_bucket_server_side_encryption_configuration","tf_rpc": "ApplyResourceChange"}\nsome garbage\n-expected_permissions3] PASSED
infrahouse_toolkit/cli/ih_plan/cmd_min_permissions/tests/actionlist/test_parse_trace.py::test_parse_trace_permissions_map[\n{"tf_resource_type": "aws_s3_bucket_versioning","tf_rpc": "ApplyResourceChange"}\n{"tf_resource_type": "aws_s3_bucket_versioning","tf_rpc": "ApplyResourceChange"}\nsome garbage\n-expected_permissions4] PASSED
infrahouse_toolkit/cli/tests/test_get_bucket.py::test_get_bucket PASSED
infrahouse_toolkit/lock/tests/test_system_lock.py::test_system_lock PASSED
infrahouse_toolkit/lock/tests/test_system_lock.py::test_system_lock_non_blocking PASSED
infrahouse_toolkit/terraform/backends/tests/test_get_backend.py::test_get_backend_raises PASSED
infrahouse_toolkit/terraform/backends/tests/test_get_backend.py::test_get_backend PASSED
infrahouse_toolkit/terraform/backends/tests/s3backend/test_eq.py::test_eq PASSED
infrahouse_toolkit/terraform/backends/tests/s3backend/test_init.py::test_init PASSED
infrahouse_toolkit/terraform/backends/tests/s3backend/test_region.py::test_region[None-args0-None] PASSED
infrahouse_toolkit/terraform/backends/tests/s3backend/test_region.py::test_region[foo_region-args1-foo_region] PASSED
infrahouse_toolkit/terraform/backends/tests/s3backend/test_region.py::test_region[foo_region-args2-bar_region] PASSED
infrahouse_toolkit/terraform/tests/test_parse_comment.py::test_parse_comment_raises[] PASSED
infrahouse_toolkit/terraform/tests/test_parse_comment.py::test_parse_comment_raises[None] PASSED
infrahouse_toolkit/terraform/tests/test_parse_comment.py::test_parse_comment_raises[foo] PASSED
infrahouse_toolkit/terraform/tests/test_parse_comment.py::test_parse_comment[\n# State **`s3://foo_backet/path/to/tf.state`**\n## Affected resources counts\n\n|  Success  |   \U0001f7e2 Add |   \U0001f7e1 Change |   \U0001f534 Destroy |\n|:---------:|--------:|-----------:|------------:|\n|     \u2705     |       1 |          1 |           1 |\n<details>\n<summary>STDOUT</summary>\n\n```\nno stdout\n```\n</details>\n<details>\n<summary>STDERR</summary>\n\n```no output```\n</details>\n<details><summary><i>metadata</i></summary>\n<p>\n```eyJzMzovL2Zvb19iYWNrZXQvcGF0aC90by90Zi5zdGF0ZSI6IHsic3VjY2VzcyI6IHRydWUsICJzdGRvdXQiOiAibm8gc3Rkb3V0IiwgInN0ZGVyciI6IG51bGwsICJhZGQiOiAxLCAiY2hhbmdlIjogMSwgImRlc3Ryb3kiOiAxfX0=```\n</p></details>-status0] parsed_status = {"s3://foo_backet/path/to/tf.state": {"success": true, "stdout": "no stdout", "stderr": null, "add": 1, "change": 1, "destroy": 1}}
status = {"s3://foo_backet/path/to/tf.state": {"success": true, "stdout": "no stdout", "stderr": null, "add": 1, "change": 1, "destroy": 1}}
PASSED
infrahouse_toolkit/terraform/tests/test_parse_comment.py::test_parse_comment[\n# State **`s3://foo_backet/path/to/tf.state`**\n## Affected resources counts\n\n|  Success  |   \U0001f7e2 Add |   \U0001f7e1 Change |   \U0001f534 Destroy |\n|:---------:|--------:|-----------:|------------:|\n|     \u2705     |       1 |          1 |           1 |\n<details>\n<summary>STDOUT</summary>\n\n```\nno output\n```\n</details>\n<details>\n<summary>STDERR</summary>\n\n```no output```\n</details>\n<details><summary><i>metadata</i></summary>\n<p>\n```eyJzMzovL2Zvb19iYWNrZXQvcGF0aC90by90Zi5zdGF0ZSI6IHsic3VjY2VzcyI6IHRydWUsICJzdGRvdXQiOiBudWxsLCAic3RkZXJyIjogbnVsbCwgImFkZCI6IDEsICJjaGFuZ2UiOiAxLCAiZGVzdHJveSI6IDF9fQ==```\n</p></details>-status1] parsed_status = {"s3://foo_backet/path/to/tf.state": {"success": true, "stdout": null, "stderr": null, "add": 1, "change": 1, "destroy": 1}}
status = {"s3://foo_backet/path/to/tf.state": {"success": true, "stdout": null, "stderr": null, "add": 1, "change": 1, "destroy": 1}}
PASSED
infrahouse_toolkit/terraform/tests/test_parse_comment.py::test_parse_comment[# **`s3://foo_backet/path/to/tf.state`**\n|  Success  |   \U0001f7e2 Add |   \U0001f7e1 Change |   \U0001f534 Destroy |\n|:---------:|--------:|-----------:|------------:|\n|     \u2705     |       1 |          1 |           1 |\n<details><summary>STDOUT</summary>\n\n```no stdout```\n\n</details>\n\n<details><summary>STDERR</summary>\n\n```no output```\n\n</details>\n\n<details><summary><i>metadata</i></summary>\r\n<p>\n\n```eyJzMzovL2Zvb19iYWNrZXQvcGF0aC90by90Zi5zdGF0ZSI6IHsic3VjY2VzcyI6IHRydWUsICJzdGRvdXQiOiAibm8gc3Rkb3V0IiwgInN0ZGVyciI6IG51bGwsICJhZGQiOiAxLCAiY2hhbmdlIjogMSwgImRlc3Ryb3kiOiAxfX0=```\n\n</p>\n</details>\n\n    -status2] parsed_status = {"s3://foo_backet/path/to/tf.state": {"success": true, "stdout": "no stdout", "stderr": null, "add": 1, "change": 1, "destroy": 1}}
status = {"s3://foo_backet/path/to/tf.state": {"success": true, "stdout": "no stdout", "stderr": null, "add": 1, "change": 1, "destroy": 1}}
PASSED
infrahouse_toolkit/terraform/tests/test_parse_plan.py::test_parse_plan[-expected_result0] PASSED
infrahouse_toolkit/terraform/tests/test_parse_plan.py::test_parse_plan[None-expected_result1] PASSED
infrahouse_toolkit/terraform/tests/test_parse_plan.py::test_parse_plan[terraform init\n\x1b[0m\x1b[1mInitializing modules...\x1b[0m\n\n\x1b[0m\x1b[1mInitializing the backend...\x1b[0m\n\n\x1b[0m\x1b[1mInitializing provider plugins...\x1b[0m\n- Reusing previous version of integrations/github from the dependency lock file\n- Reusing previous version of hashicorp/aws from the dependency lock file\n- Using previously-installed integrations/github v5.17.0\n- Using previously-installed hashicorp/aws v4.54.0\n\n\x1b[0m\x1b[1m\x1b[32mTerraform has been successfully initialized!\x1b[0m\x1b[32m\x1b[0m\n\x1b[0m\x1b[32m\nYou may now begin working with Terraform. Try running "terraform plan" to see\nany changes that are required for your infrastructure. All Terraform commands\nshould now work.\n\nIf you ever set or change modules or backend configuration for Terraform,\nrerun this command to reinitialize your working directory. If you forget, other\ncommands will detect it and remind you to do so if necessary.\x1b[0m\nterraform plan -var-file=configuration.tfvars --out=tf.plan\n\x1b[0m\x1b[1mgithub_membership.infrahouse["akuzminsky"]: Refreshing state... [id=infrahouse:akuzminsky]\x1b[0m\n\x1b[0m\x1b[1mgithub_team.dev: Refreshing state... [id=7332815]\x1b[0m\n\x1b[0m\x1b[1mgithub_organization_settings.infrahouse: Refreshing state... [id=121984263]\x1b[0m\n\x1b[0m\x1b[1maws_secretsmanager_secret.pypi_api_token: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:990466748045:secret:_github_control__PYPI_API_TOKEN-dhII9P]\x1b[0m\n\x1b[0m\x1b[1mdata.aws_secretsmanager_secret_version.pypi_api_token: Reading...\x1b[0m\x1b[0m\n\x1b[0m\x1b[1mdata.aws_secretsmanager_secret_version.pypi_api_token: Read complete after 0s [id=arn:aws:secretsmanager:us-west-1:990466748045:secret:_github_control__PYPI_API_TOKEN-dhII9P|AWSCURRENT]\x1b[0m\n\x1b[0m\x1b[1mgithub_actions_secret.pypi_api_token["infrahouse-toolkit"]: Refreshing state... [id=infrahouse-toolkit:PYPI_API_TOKEN]\x1b[0m\n\x1b[0m\x1b[1mgithub_team_members.dev: Refreshing state... [id=7332815]\x1b[0m\n\x1b[0m\x1b[1mmodule.repos["cookiecutter-github-control"].github_repository.repo: Refreshing state... [id=cookiecutter-github-control]\x1b[0m\n\x1b[0m\x1b[1mmodule.repos["infrahouse-toolkit"].github_repository.repo: Refreshing state... [id=infrahouse-toolkit]\x1b[0m\n\x1b[0m\x1b[1mmodule.repos["cookiecutter-github-control"].github_team_repository.dev: Refreshing state... [id=7332815:cookiecutter-github-control]\x1b[0m\n\x1b[0m\x1b[1mmodule.repos["infrahouse-toolkit"].github_team_repository.dev: Refreshing state... [id=7332815:infrahouse-toolkit]\x1b[0m\n\n\x1b[0m\x1b[1m\x1b[32mNo changes.\x1b[0m\x1b[1m Your infrastructure matches the configuration.\x1b[0m\n\n\x1b[0mTerraform has compared your real infrastructure against your configuration\nand found no differences, so no changes are needed.\n-expected_result2] PASSED
infrahouse_toolkit/terraform/tests/test_parse_plan.py::test_parse_plan[terraform init\n\x1b[0m\x1b[1mInitializing modules...\x1b[0m\n\n\x1b[0m\x1b[1mInitializing the backend...\x1b[0m\n\n\x1b[0m\x1b[1mInitializing provider plugins...\x1b[0m\n- Reusing previous version of hashicorp/aws from the dependency lock file\n- Reusing previous version of integrations/github from the dependency lock file\n- Using previously-installed hashicorp/aws v4.54.0\n- Using previously-installed integrations/github v5.17.0\n\n\x1b[0m\x1b[1m\x1b[32mTerraform has been successfully initialized!\x1b[0m\x1b[32m\x1b[0m\n\x1b[0m\x1b[32m\nYou may now begin working with Terraform. Try running "terraform plan" to see\nany changes that are required for your infrastructure. All Terraform commands\nshould now work.\n\nIf you ever set or change modules or backend configuration for Terraform,\nrerun this command to reinitialize your working directory. If you forget, other\ncommands will detect it and remind you to do so if necessary.\x1b[0m\nterraform plan -var-file=configuration.tfvars --out=tf.plan\n\x1b[0m\x1b[1maws_secretsmanager_secret.pypi_api_token: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:990466748045:secret:_github_control__PYPI_API_TOKEN-dhII9P]\x1b[0m\n\x1b[0m\x1b[1mgithub_membership.infrahouse["akuzminsky"]: Refreshing state... [id=infrahouse:akuzminsky]\x1b[0m\n\x1b[0m\x1b[1mgithub_team.dev: Refreshing state... [id=7332815]\x1b[0m\n\x1b[0m\x1b[1mgithub_organization_settings.infrahouse: Refreshing state... [id=121984263]\x1b[0m\n\x1b[0m\x1b[1mdata.aws_secretsmanager_secret_version.pypi_api_token: Reading...\x1b[0m\x1b[0m\n\x1b[0m\x1b[1mdata.aws_secretsmanager_secret_version.pypi_api_token: Read complete after 0s [id=arn:aws:secretsmanager:us-west-1:990466748045:secret:_github_control__PYPI_API_TOKEN-dhII9P|AWSCURRENT]\x1b[0m\n\x1b[0m\x1b[1mgithub_actions_secret.pypi_api_token["infrahouse-toolkit"]: Refreshing state... [id=infrahouse-toolkit:PYPI_API_TOKEN]\x1b[0m\n\x1b[0m\x1b[1mmodule.repos["cookiecutter-github-control"].github_repository.repo: Refreshing state... [id=cookiecutter-github-control]\x1b[0m\n\x1b[0m\x1b[1mmodule.repos["infrahouse-toolkit"].github_repository.repo: Refreshing state... [id=infrahouse-toolkit]\x1b[0m\n\x1b[0m\x1b[1mgithub_team_members.dev: Refreshing state... [id=7332815]\x1b[0m\n\x1b[0m\x1b[1mmodule.repos["infrahouse-toolkit"].github_team_repository.dev: Refreshing state... [id=7332815:infrahouse-toolkit]\x1b[0m\n\x1b[0m\x1b[1mmodule.repos["cookiecutter-github-control"].github_team_repository.dev: Refreshing state... [id=7332815:cookiecutter-github-control]\x1b[0m\n\nTerraform used the selected providers to generate the following execution\nplan. Resource actions are indicated with the following symbols:\n  \x1b[32m+\x1b[0m create\n\x1b[0m\nTerraform will perform the following actions:\n\n\x1b[1m  # module.repos["test"].github_repository.repo\x1b[0m will be created\x1b[0m\x1b[0m\n\x1b[0m  \x1b[32m+\x1b[0m\x1b[0m resource "github_repository" "repo" {\n      \x1b[32m+\x1b[0m \x1b[0m\x1b[1m\x1b[0mallow_auto_merge\x1b[0m\x1b[0m            = false\n      \x1b[32m+\x1b[0m \x1b[0m\x1b[1m\x1b[0mallow_merge_commit\x1b[0m\x1b[0m          = true\n      \x1b[32m+\x1b[0m \x1b[0m\x1b[1m\x1b[0mallow_rebase_merge\x1b[0m\x1b[0m          = true\n      \x1b[32m+\x1b[0m \x1b[0m\x1b[1m\x1b[0mallow_squash_merge\x1b[0m\x1b[0m          = true\n      \x1b[32m+\x1b[0m \x1b[0m\x1b[1m\x1b[0marchived\x1b[0m\x1b[0m                    = false\n      \x1b[32m+\x1b[0m \x1b[0m\x1b[1m\x1b[0mdefault_branch\x1b[0m\x1b[0m              = (known after apply)\n      \x1b[32m+\x1b[0m \x1b[0m\x1b[1m\x1b[0mdelete_branch_on_merge\x1b[0m\x1b[0m      = false\n      \x1b[32m+\x1b[0m \x1b[0m\x1b[1m\x1b[0mdescription\x1b[0m\x1b[0m                 = "Template for a GitHub Control repository"\n      \x1b[32m+\x1b[0m \x1b[0m\x1b[1m\x1b[0metag\x1b[0m\x1b[0m                        = (known after apply)\n      \x1b[32m+\x1b[0m \x1b[0m\x1b[1m\x1b[0mfull_name\x1b[0m\x1b[0m                   = (known after apply)\n      \x1b[32m+\x1b[0m \x1b[0m\x1b[1m\x1b[0mgit_clone_url\x1b[0m\x1b[0m               = (known after apply)\n      \x1b[32m+\x1b[0m \x1b[0m\x1b[1m\x1b[0mhas_issues\x1b[0m\x1b[0m                  = true\n      \x1b[32m+\x1b[0m \x1b[0m\x1b[1m\x1b[0mhtml_url\x1b[0m\x1b[0m                    = (known after apply)\n      \x1b[32m+\x1b[0m \x1b[0m\x1b[1m\x1b[0mhttp_clone_url\x1b[0m\x1b[0m              = (known after apply)\n      \x1b[32m+\x1b[0m \x1b[0m\x1b[1m\x1b[0mid\x1b[0m\x1b[0m                          = (known after apply)\n      \x1b[32m+\x1b[0m \x1b[0m\x1b[1m\x1b[0mmerge_commit_message\x1b[0m\x1b[0m        = "PR_TITLE"\n      \x1b[32m+\x1b[0m \x1b[0m\x1b[1m\x1b[0mmerge_commit_title\x1b[0m\x1b[0m          = "MERGE_MESSAGE"\n      \x1b[32m+\x1b[0m \x1b[0m\x1b[1m\x1b[0mname\x1b[0m\x1b[0m                        = "test"\n      \x1b[32m+\x1b[0m \x1b[0m\x1b[1m\x1b[0mnode_id\x1b[0m\x1b[0m                     = (known after apply)\n      \x1b[32m+\x1b[0m \x1b[0m\x1b[1m\x1b[0mprivate\x1b[0m\x1b[0m                     = (known after apply)\n      \x1b[32m+\x1b[0m \x1b[0m\x1b[1m\x1b[0mrepo_id\x1b[0m\x1b[0m                     = (known after apply)\n      \x1b[32m+\x1b[0m \x1b[0m\x1b[1m\x1b[0msquash_merge_commit_message\x1b[0m\x1b[0m = "COMMIT_MESSAGES"\n      \x1b[32m+\x1b[0m \x1b[0m\x1b[1m\x1b[0msquash_merge_commit_title\x1b[0m\x1b[0m   = "COMMIT_OR_PR_TITLE"\n      \x1b[32m+\x1b[0m \x1b[0m\x1b[1m\x1b[0mssh_clone_url\x1b[0m\x1b[0m               = (known after apply)\n      \x1b[32m+\x1b[0m \x1b[0m\x1b[1m\x1b[0msvn_url\x1b[0m\x1b[0m                     = (known after apply)\n      \x1b[32m+\x1b[0m \x1b[0m\x1b[1m\x1b[0mvisibility\x1b[0m\x1b[0m                  = "public"\n\n      \x1b[32m+\x1b[0m \x1b[0msecurity_and_analysis {\n          \x1b[32m+\x1b[0m \x1b[0madvanced_security {\n              \x1b[32m+\x1b[0m \x1b[0m\x1b[1m\x1b[0mstatus\x1b[0m\x1b[0m = (known after apply)\n            }\n\n          \x1b[32m+\x1b[0m \x1b[0msecret_scanning {\n              \x1b[32m+\x1b[0m \x1b[0m\x1b[1m\x1b[0mstatus\x1b[0m\x1b[0m = (known after apply)\n            }\n\n          \x1b[32m+\x1b[0m \x1b[0msecret_scanning_push_protection {\n              \x1b[32m+\x1b[0m \x1b[0m\x1b[1m\x1b[0mstatus\x1b[0m\x1b[0m = (known after apply)\n            }\n        }\n    }\n\n\x1b[1m  # module.repos["test"].github_team_repository.dev\x1b[0m will be created\x1b[0m\x1b[0m\n\x1b[0m  \x1b[32m+\x1b[0m\x1b[0m resource "github_team_repository" "dev" {\n      \x1b[32m+\x1b[0m \x1b[0m\x1b[1m\x1b[0metag\x1b[0m\x1b[0m       = (known after apply)\n      \x1b[32m+\x1b[0m \x1b[0m\x1b[1m\x1b[0mid\x1b[0m\x1b[0m         = (known after apply)\n      \x1b[32m+\x1b[0m \x1b[0m\x1b[1m\x1b[0mpermission\x1b[0m\x1b[0m = "push"\n      \x1b[32m+\x1b[0m \x1b[0m\x1b[1m\x1b[0mrepository\x1b[0m\x1b[0m = "test"\n      \x1b[32m+\x1b[0m \x1b[0m\x1b[1m\x1b[0mteam_id\x1b[0m\x1b[0m    = "7332815"\n    }\n\n\x1b[0m\x1b[1mPlan:\x1b[0m 2 to add, 0 to change, 0 to destroy.\n\x1b[0m\x1b[90m\n\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\x1b[0m\n\nSaved the plan to: tf.plan\n\nTo perform exactly these actions, run the following command to apply:\n    terraform apply "tf.plan"\n-expected_result3] PASSED
infrahouse_toolkit/terraform/tests/test_parse_plan.py::test_parse_plan[terraform init\n\x1b[0m\x1b[1mInitializing modules...\x1b[0m\n\n\x1b[0m\x1b[1mInitializing the backend...\x1b[0m\n\n\x1b[0m\x1b[1mInitializing provider plugins...\x1b[0m\n- Reusing previous version of hashicorp/aws from the dependency lock file\n- Reusing previous version of integrations/github from the dependency lock file\n- Using previously-installed hashicorp/aws v4.54.0\n- Using previously-installed integrations/github v5.17.0\n\n\x1b[0m\x1b[1m\x1b[32mTerraform has been successfully initialized!\x1b[0m\x1b[32m\x1b[0m\n\x1b[0m\x1b[32m\nYou may now begin working with Terraform. Try running "terraform plan" to see\nany changes that are required for your infrastructure. All Terraform commands\nshould now work.\n\nIf you ever set or change modules or backend configuration for Terraform,\nrerun this command to reinitialize your working directory. If you forget, other\ncommands will detect it and remind you to do so if necessary.\x1b[0m\nterraform plan -var-file=configuration.tfvars --out=tf.plan\n\x1b[0m\x1b[1maws_secretsmanager_secret.pypi_api_token: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:990466748045:secret:_github_control__PYPI_API_TOKEN-dhII9P]\x1b[0m\n\x1b[0m\x1b[1mdata.aws_secretsmanager_secret_version.pypi_api_token: Reading...\x1b[0m\x1b[0m\n\x1b[0m\x1b[1mgithub_membership.infrahouse["akuzminsky"]: Refreshing state... [id=infrahouse:akuzminsky]\x1b[0m\n\x1b[0m\x1b[1mgithub_team.dev: Refreshing state... [id=7332815]\x1b[0m\n\x1b[0m\x1b[1mgithub_organization_settings.infrahouse: Refreshing state... [id=121984263]\x1b[0m\n\x1b[0m\x1b[1mdata.aws_secretsmanager_secret_version.pypi_api_token: Read complete after 0s [id=arn:aws:secretsmanager:us-west-1:990466748045:secret:_github_control__PYPI_API_TOKEN-dhII9P|AWSCURRENT]\x1b[0m\n\x1b[0m\x1b[1mgithub_actions_secret.pypi_api_token["infrahouse-toolkit"]: Refreshing state... [id=infrahouse-toolkit:PYPI_API_TOKEN]\x1b[0m\n\x1b[0m\x1b[1mmodule.repos["infrahouse-toolkit"].github_repository.repo: Refreshing state... [id=infrahouse-toolkit]\x1b[0m\n\x1b[0m\x1b[1mmodule.repos["cookiecutter-github-control"].github_repository.repo: Refreshing state... [id=cookiecutter-github-control]\x1b[0m\n\x1b[0m\x1b[1mgithub_team_members.dev: Refreshing state... [id=7332815]\x1b[0m\n\x1b[0m\x1b[1mmodule.repos["infrahouse-toolkit"].github_team_repository.dev: Refreshing state... [id=7332815:infrahouse-toolkit]\x1b[0m\n\x1b[0m\x1b[1mmodule.repos["cookiecutter-github-control"].github_team_repository.dev: Refreshing state... [id=7332815:cookiecutter-github-control]\x1b[0m\n\nTerraform used the selected providers to generate the following execution\nplan. Resource actions are indicated with the following symbols:\n  \x1b[32m+\x1b[0m create\n  \x1b[33m~\x1b[0m update in-place\n  \x1b[31m-\x1b[0m destroy\n\x1b[0m\nTerraform will perform the following actions:\n\n\x1b[1m  # module.repos["cookiecutter-github-control"].github_repository.repo\x1b[0m will be \x1b[1m\x1b[31mdestroyed\x1b[0m\n  # (because module.repos["cookiecutter-github-control"] is not in configuration)\x1b[0m\n\x1b[0m  \x1b[31m-\x1b[0m\x1b[0m resource "github_repository" "repo" {\n      \x1b[31m-\x1b[0m \x1b[0m\x1b[1m\x1b[0mallow_auto_merge\x1b[0m\x1b[0m            = false \x1b[90m->\x1b[0m \x1b[0m\x1b[90mnull\x1b[0m\x1b[0m\n      \x1b[31m-\x1b[0m \x1b[0m\x1b[1m\x1b[0mallow_merge_commit\x1b[0m\x1b[0m          = true \x1b[90m->\x1b[0m \x1b[0m\x1b[90mnull\x1b[0m\x1b[0m\n      \x1b[31m-\x1b[0m \x1b[0m\x1b[1m\x1b[0mallow_rebase_merge\x1b[0m\x1b[0m          = true \x1b[90m->\x1b[0m \x1b[0m\x1b[90mnull\x1b[0m\x1b[0m\n      \x1b[31m-\x1b[0m \x1b[0m\x1b[1m\x1b[0mallow_squash_merge\x1b[0m\x1b[0m          = true \x1b[90m->\x1b[0m \x1b[0m\x1b[90mnull\x1b[0m\x1b[0m\n      \x1b[31m-\x1b[0m \x1b[0m\x1b[1m\x1b[0mallow_update_branch\x1b[0m\x1b[0m         = false \x1b[90m->\x1b[0m \x1b[0m\x1b[90mnull\x1b[0m\x1b[0m\n      \x1b[31m-\x1b[0m \x1b[0m\x1b[1m\x1b[0marchived\x1b[0m\x1b[0m                    = false \x1b[90m->\x1b[0m \x1b[0m\x1b[90mnull\x1b[0m\x1b[0m\n      \x1b[31m-\x1b[0m \x1b[0m\x1b[1m\x1b[0mdefault_branch\x1b[0m\x1b[0m              = "main" \x1b[90m->\x1b[0m \x1b[0m\x1b[90mnull\x1b[0m\x1b[0m\n      \x1b[31m-\x1b[0m \x1b[0m\x1b[1m\x1b[0mdelete_branch_on_merge\x1b[0m\x1b[0m      = false \x1b[90m->\x1b[0m \x1b[0m\x1b[90mnull\x1b[0m\x1b[0m\n      \x1b[31m-\x1b[0m \x1b[0m\x1b[1m\x1b[0mdescription\x1b[0m\x1b[0m                 = "Template for a GitHub Control repository" \x1b[90m->\x1b[0m \x1b[0m\x1b[90mnull\x1b[0m\x1b[0m\n      \x1b[31m-\x1b[0m \x1b[0m\x1b[1m\x1b[0metag\x1b[0m\x1b[0m                        = "W/\\"8b4a792bc1474d381caaa63b76668993b4adc42ae76ed53d6886d8562ebb0c67\\"" \x1b[90m->\x1b[0m \x1b[0m\x1b[90mnull\x1b[0m\x1b[0m\n      \x1b[31m-\x1b[0m \x1b[0m\x1b[1m\x1b[0mfull_name\x1b[0m\x1b[0m                   = "infrahouse/cookiecutter-github-control" \x1b[90m->\x1b[0m \x1b[0m\x1b[90mnull\x1b[0m\x1b[0m\n      \x1b[31m-\x1b[0m \x1b[0m\x1b[1m\x1b[0mgit_clone_url\x1b[0m\x1b[0m               = "git://github.com/infrahouse/cookiecutter-github-control.git" \x1b[90m->\x1b[0m \x1b[0m\x1b[90mnull\x1b[0m\x1b[0m\n      \x1b[31m-\x1b[0m \x1b[0m\x1b[1m\x1b[0mhas_discussions\x1b[0m\x1b[0m             = false \x1b[90m->\x1b[0m \x1b[0m\x1b[90mnull\x1b[0m\x1b[0m\n      \x1b[31m-\x1b[0m \x1b[0m\x1b[1m\x1b[0mhas_downloads\x1b[0m\x1b[0m               = false \x1b[90m->\x1b[0m \x1b[0m\x1b[90mnull\x1b[0m\x1b[0m\n      \x1b[31m-\x1b[0m \x1b[0m\x1b[1m\x1b[0mhas_issues\x1b[0m\x1b[0m                  = true \x1b[90m->\x1b[0m \x1b[0m\x1b[90mnull\x1b[0m\x1b[0m\n      \x1b[31m-\x1b[0m \x1b[0m\x1b[1m\x1b[0mhas_projects\x1b[0m\x1b[0m                = false \x1b[90m->\x1b[0m \x1b[0m\x1b[90mnull\x1b[0m\x1b[0m\n      \x1b[31m-\x1b[0m \x1b[0m\x1b[1m\x1b[0mhas_wiki\x1b[0m\x1b[0m                    = false \x1b[90m->\x1b[0m \x1b[0m\x1b[90mnull\x1b[0m\x1b[0m\n      \x1b[31m-\x1b[0m \x1b[0m\x1b[1m\x1b[0mhtml_url\x1b[0m\x1b[0m                    = "https://github.com/infrahouse/cookiecutter-github-control" \x1b[90m->\x1b[0m \x1b[0m\x1b[90mnull\x1b[0m\x1b[0m\n      \x1b[31m-\x1b[0m \x1b[0m\x1b[1m\x1b[0mhttp_clone_url\x1b[0m\x1b[0m              = "https://github.com/infrahouse/cookiecutter-github-control.git" \x1b[90m->\x1b[0m \x1b[0m\x1b[90mnull\x1b[0m\x1b[0m\n      \x1b[31m-\x1b[0m \x1b[0m\x1b[1m\x1b[0mid\x1b[0m\x1b[0m                          = "cookiecutter-github-control" \x1b[90m->\x1b[0m \x1b[0m\x1b[90mnull\x1b[0m\x1b[0m\n      \x1b[31m-\x1b[0m \x1b[0m\x1b[1m\x1b[0mis_template\x1b[0m\x1b[0m                 = false \x1b[90m->\x1b[0m \x1b[0m\x1b[90mnull\x1b[0m\x1b[0m\n      \x1b[31m-\x1b[0m \x1b[0m\x1b[1m\x1b[0mmerge_commit_message\x1b[0m\x1b[0m        = "PR_TITLE" \x1b[90m->\x1b[0m \x1b[0m\x1b[90mnull\x1b[0m\x1b[0m\n      \x1b[31m-\x1b[0m \x1b[0m\x1b[1m\x1b[0mmerge_commit_title\x1b[0m\x1b[0m          = "MERGE_MESSAGE" \x1b[90m->\x1b[0m \x1b[0m\x1b[90mnull\x1b[0m\x1b[0m\n      \x1b[31m-\x1b[0m \x1b[0m\x1b[1m\x1b[0mname\x1b[0m\x1b[0m                        = "cookiecutter-github-control" \x1b[90m->\x1b[0m \x1b[0m\x1b[90mnull\x1b[0m\x1b[0m\n      \x1b[31m-\x1b[0m \x1b[0m\x1b[1m\x1b[0mnode_id\x1b[0m\x1b[0m                     = "R_kgDOI528zg" \x1b[90m->\x1b[0m \x1b[0m\x1b[90mnull\x1b[0m\x1b[0m\n      \x1b[31m-\x1b[0m \x1b[0m\x1b[1m\x1b[0mprivate\x1b[0m\x1b[0m                     = false \x1b[90m->\x1b[0m \x1b[0m\x1b[90mnull\x1b[0m\x1b[0m\n      \x1b[31m-\x1b[0m \x1b[0m\x1b[1m\x1b[0mrepo_id\x1b[0m\x1b[0m                     = 597540046 \x1b[90m->\x1b[0m \x1b[0m\x1b[90mnull\x1b[0m\x1b[0m\n      \x1b[31m-\x1b[0m \x1b[0m\x1b[1m\x1b[0msquash_merge_commit_message\x1b[0m\x1b[0m = "COMMIT_MESSAGES" \x1b[90m->\x1b[0m \x1b[0m\x1b[90mnull\x1b[0m\x1b[0m\n      \x1b[31m-\x1b[0m \x1b[0m\x1b[1m\x1b[0msquash_merge_commit_title\x1b[0m\x1b[0m   = "COMMIT_OR_PR_TITLE" \x1b[90m->\x1b[0m \x1b[0m\x1b[90mnull\x1b[0m\x1b[0m\n      \x1b[31m-\x1b[0m \x1b[0m\x1b[1m\x1b[0mssh_clone_url\x1b[0m\x1b[0m               = "git@github.com:infrahouse/cookiecutter-github-control.git" \x1b[90m->\x1b[0m \x1b[0m\x1b[90mnull\x1b[0m\x1b[0m\n      \x1b[31m-\x1b[0m \x1b[0m\x1b[1m\x1b[0msvn_url\x1b[0m\x1b[0m                     = "https://github.com/infrahouse/cookiecutter-github-control" \x1b[90m->\x1b[0m \x1b[0m\x1b[90mnull\x1b[0m\x1b[0m\n      \x1b[31m-\x1b[0m \x1b[0m\x1b[1m\x1b[0mtopics\x1b[0m\x1b[0m                      = [] \x1b[90m->\x1b[0m \x1b[0m\x1b[90mnull\x1b[0m\x1b[0m\n      \x1b[31m-\x1b[0m \x1b[0m\x1b[1m\x1b[0mvisibility\x1b[0m\x1b[0m                  = "public" \x1b[90m->\x1b[0m \x1b[0m\x1b[90mnull\x1b[0m\x1b[0m\n      \x1b[31m-\x1b[0m \x1b[0m\x1b[1m\x1b[0mvulnerability_alerts\x1b[0m\x1b[0m        = false \x1b[90m->\x1b[0m \x1b[0m\x1b[90mnull\x1b[0m\x1b[0m\n\n      \x1b[31m-\x1b[0m \x1b[0msecurity_and_analysis {\n\n          \x1b[31m-\x1b[0m \x1b[0msecret_scanning {\n              \x1b[31m-\x1b[0m \x1b[0m\x1b[1m\x1b[0mstatus\x1b[0m\x1b[0m = "disabled" \x1b[90m->\x1b[0m \x1b[0m\x1b[90mnull\x1b[0m\x1b[0m\n            }\n\n          \x1b[31m-\x1b[0m \x1b[0msecret_scanning_push_protection {\n              \x1b[31m-\x1b[0m \x1b[0m\x1b[1m\x1b[0mstatus\x1b[0m\x1b[0m = "disabled" \x1b[90m->\x1b[0m \x1b[0m\x1b[90mnull\x1b[0m\x1b[0m\n            }\n        }\n    }\n\n\x1b[1m  # module.repos["cookiecutter-github-control"].github_team_repository.dev\x1b[0m will be \x1b[1m\x1b[31mdestroyed\x1b[0m\n  # (because module.repos["cookiecutter-github-control"] is not in configuration)\x1b[0m\n\x1b[0m  \x1b[31m-\x1b[0m\x1b[0m resource "github_team_repository" "dev" {\n      \x1b[31m-\x1b[0m \x1b[0m\x1b[1m\x1b[0metag\x1b[0m\x1b[0m       = "W/\\"8043f81b19693f6c1a72d21bb8dc03859c98bf78bfbe79782bfe13fa813992ca\\"" \x1b[90m->\x1b[0m \x1b[0m\x1b[90mnull\x1b[0m\x1b[0m\n      \x1b[31m-\x1b[0m \x1b[0m\x1b[1m\x1b[0mid\x1b[0m\x1b[0m         = "7332815:cookiecutter-github-control" \x1b[90m->\x1b[0m \x1b[0m\x1b[90mnull\x1b[0m\x1b[0m\n      \x1b[31m-\x1b[0m \x1b[0m\x1b[1m\x1b[0mpermission\x1b[0m\x1b[0m = "push" \x1b[90m->\x1b[0m \x1b[0m\x1b[90mnull\x1b[0m\x1b[0m\n      \x1b[31m-\x1b[0m \x1b[0m\x1b[1m\x1b[0mrepository\x1b[0m\x1b[0m = "cookiecutter-github-control" \x1b[90m->\x1b[0m \x1b[0m\x1b[90mnull\x1b[0m\x1b[0m\n      \x1b[31m-\x1b[0m \x1b[0m\x1b[1m\x1b[0mteam_id\x1b[0m\x1b[0m    = "7332815" \x1b[90m->\x1b[0m \x1b[0m\x1b[90mnull\x1b[0m\x1b[0m\n    }\n\n\x1b[1m  # module.repos["infrahouse-toolkit"].github_repository.repo\x1b[0m will be updated in-place\x1b[0m\x1b[0m\n\x1b[0m  \x1b[33m~\x1b[0m\x1b[0m resource "github_repository" "repo" {\n      \x1b[33m~\x1b[0m \x1b[0m\x1b[1m\x1b[0mdescription\x1b[0m\x1b[0m                 = "InfraHouse Toolkit" \x1b[33m->\x1b[0m \x1b[0m"InfraHouse Toolkit1"\n        \x1b[1m\x1b[0mid\x1b[0m\x1b[0m                          = "infrahouse-toolkit"\n        \x1b[1m\x1b[0mname\x1b[0m\x1b[0m                        = "infrahouse-toolkit"\n        \x1b[90m# (31 unchanged attributes hidden)\x1b[0m\x1b[0m\n\n        \x1b[90m# (1 unchanged block hidden)\x1b[0m\x1b[0m\n    }\n\n\x1b[1m  # module.repos["test"].github_repository.repo\x1b[0m will be created\x1b[0m\x1b[0m\n\x1b[0m  \x1b[32m+\x1b[0m\x1b[0m resource "github_repository" "repo" {\n      \x1b[32m+\x1b[0m \x1b[0m\x1b[1m\x1b[0mallow_auto_merge\x1b[0m\x1b[0m            = false\n      \x1b[32m+\x1b[0m \x1b[0m\x1b[1m\x1b[0mallow_merge_commit\x1b[0m\x1b[0m          = true\n      \x1b[32m+\x1b[0m \x1b[0m\x1b[1m\x1b[0mallow_rebase_merge\x1b[0m\x1b[0m          = true\n      \x1b[32m+\x1b[0m \x1b[0m\x1b[1m\x1b[0mallow_squash_merge\x1b[0m\x1b[0m          = true\n      \x1b[32m+\x1b[0m \x1b[0m\x1b[1m\x1b[0marchived\x1b[0m\x1b[0m                    = false\n      \x1b[32m+\x1b[0m \x1b[0m\x1b[1m\x1b[0mdefault_branch\x1b[0m\x1b[0m              = (known after apply)\n      \x1b[32m+\x1b[0m \x1b[0m\x1b[1m\x1b[0mdelete_branch_on_merge\x1b[0m\x1b[0m      = false\n      \x1b[32m+\x1b[0m \x1b[0m\x1b[1m\x1b[0mdescription\x1b[0m\x1b[0m                 = "Template for a GitHub Control repository"\n      \x1b[32m+\x1b[0m \x1b[0m\x1b[1m\x1b[0metag\x1b[0m\x1b[0m                        = (known after apply)\n      \x1b[32m+\x1b[0m \x1b[0m\x1b[1m\x1b[0mfull_name\x1b[0m\x1b[0m                   = (known after apply)\n      \x1b[32m+\x1b[0m \x1b[0m\x1b[1m\x1b[0mgit_clone_url\x1b[0m\x1b[0m               = (known after apply)\n      \x1b[32m+\x1b[0m \x1b[0m\x1b[1m\x1b[0mhas_issues\x1b[0m\x1b[0m                  = true\n      \x1b[32m+\x1b[0m \x1b[0m\x1b[1m\x1b[0mhtml_url\x1b[0m\x1b[0m                    = (known after apply)\n      \x1b[32m+\x1b[0m \x1b[0m\x1b[1m\x1b[0mhttp_clone_url\x1b[0m\x1b[0m              = (known after apply)\n      \x1b[32m+\x1b[0m \x1b[0m\x1b[1m\x1b[0mid\x1b[0m\x1b[0m                          = (known after apply)\n      \x1b[32m+\x1b[0m \x1b[0m\x1b[1m\x1b[0mmerge_commit_message\x1b[0m\x1b[0m        = "PR_TITLE"\n      \x1b[32m+\x1b[0m \x1b[0m\x1b[1m\x1b[0mmerge_commit_title\x1b[0m\x1b[0m          = "MERGE_MESSAGE"\n      \x1b[32m+\x1b[0m \x1b[0m\x1b[1m\x1b[0mname\x1b[0m\x1b[0m                        = "test"\n      \x1b[32m+\x1b[0m \x1b[0m\x1b[1m\x1b[0mnode_id\x1b[0m\x1b[0m                     = (known after apply)\n      \x1b[32m+\x1b[0m \x1b[0m\x1b[1m\x1b[0mprivate\x1b[0m\x1b[0m                     = (known after apply)\n      \x1b[32m+\x1b[0m \x1b[0m\x1b[1m\x1b[0mrepo_id\x1b[0m\x1b[0m                     = (known after apply)\n      \x1b[32m+\x1b[0m \x1b[0m\x1b[1m\x1b[0msquash_merge_commit_message\x1b[0m\x1b[0m = "COMMIT_MESSAGES"\n      \x1b[32m+\x1b[0m \x1b[0m\x1b[1m\x1b[0msquash_merge_commit_title\x1b[0m\x1b[0m   = "COMMIT_OR_PR_TITLE"\n      \x1b[32m+\x1b[0m \x1b[0m\x1b[1m\x1b[0mssh_clone_url\x1b[0m\x1b[0m               = (known after apply)\n      \x1b[32m+\x1b[0m \x1b[0m\x1b[1m\x1b[0msvn_url\x1b[0m\x1b[0m                     = (known after apply)\n      \x1b[32m+\x1b[0m \x1b[0m\x1b[1m\x1b[0mvisibility\x1b[0m\x1b[0m                  = "public"\n\n      \x1b[32m+\x1b[0m \x1b[0msecurity_and_analysis {\n          \x1b[32m+\x1b[0m \x1b[0madvanced_security {\n              \x1b[32m+\x1b[0m \x1b[0m\x1b[1m\x1b[0mstatus\x1b[0m\x1b[0m = (known after apply)\n            }\n\n          \x1b[32m+\x1b[0m \x1b[0msecret_scanning {\n              \x1b[32m+\x1b[0m \x1b[0m\x1b[1m\x1b[0mstatus\x1b[0m\x1b[0m = (known after apply)\n            }\n\n          \x1b[32m+\x1b[0m \x1b[0msecret_scanning_push_protection {\n              \x1b[32m+\x1b[0m \x1b[0m\x1b[1m\x1b[0mstatus\x1b[0m\x1b[0m = (known after apply)\n            }\n        }\n    }\n\n\x1b[1m  # module.repos["test"].github_team_repository.dev\x1b[0m will be created\x1b[0m\x1b[0m\n\x1b[0m  \x1b[32m+\x1b[0m\x1b[0m resource "github_team_repository" "dev" {\n      \x1b[32m+\x1b[0m \x1b[0m\x1b[1m\x1b[0metag\x1b[0m\x1b[0m       = (known after apply)\n      \x1b[32m+\x1b[0m \x1b[0m\x1b[1m\x1b[0mid\x1b[0m\x1b[0m         = (known after apply)\n      \x1b[32m+\x1b[0m \x1b[0m\x1b[1m\x1b[0mpermission\x1b[0m\x1b[0m = "push"\n      \x1b[32m+\x1b[0m \x1b[0m\x1b[1m\x1b[0mrepository\x1b[0m\x1b[0m = "test"\n      \x1b[32m+\x1b[0m \x1b[0m\x1b[1m\x1b[0mteam_id\x1b[0m\x1b[0m    = "7332815"\n    }\n\n\x1b[0m\x1b[1mPlan:\x1b[0m 2 to add, 1 to change, 2 to destroy.\n\x1b[0m\x1b[90m\n\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\x1b[0m\n\nSaved the plan to: tf.plan\n\nTo perform exactly these actions, run the following command to apply:\n    terraform apply "tf.plan"\n-expected_result4] PASSED
infrahouse_toolkit/terraform/tests/test_parse_plan.py::test_parse_plan[module.infrahouse8-github-control.module.state-bucket.random_pet.suffix: Refreshing state... [id=infrahouse-github-control-state-polished-lioness]\ndata.external.env: Reading...\ndata.external.env: Read complete after 0s [id=-]\nmodule.ih_8_repos["github-control"].github_repository.repo: Refreshing state... [id=github-control]\nmodule.ih8_tf_template.github_repository.repo: Refreshing state... [id=terraform-template]\ngithub_membership.infrahouse["akuzminsky"]: Refreshing state... [id=infrahouse:akuzminsky]\ngithub_team.dev: Refreshing state... [id=7332815]\ngithub_organization_settings.infrahouse: Refreshing state... [id=121984263]\nmodule.ih_tf_template.github_repository.repo: Refreshing state... [id=terraform-template]\nmodule.ih_8_repos["github-control"].github_branch_default.main: Refreshing state... [id=github-control]\nmodule.ih_8_repos["github-control"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=github-control:GH_TOKEN]\nmodule.ih_8_repos["github-control"].github_repository_collaborator.collaborators["akuzminsky"]: Refreshing state... [id=github-control:akuzminsky]\ngithub_team_members.dev: Refreshing state... [id=7332815]\nmodule.ih_8_repos["github-control"].github_branch_protection.main: Refreshing state... [id=BPR_kwDOI2vu7M4CAici]\nmodule.ih_tf_template.github_team_repository.dev[0]: Refreshing state... [id=7332815:terraform-template]\nmodule.infrahouse8-github-control.module.state-bucket.aws_dynamodb_table.terraform_locks: Refreshing state... [id=infrahouse-github-control-state-polished-lioness]\ndata.aws_secretsmanager_secrets.gh_secrets: Reading...\ndata.aws_ssm_parameter.gh_secrets_namespace: Reading...\nmodule.infrahouse8-github-control.module.gha-admin.data.aws_iam_policy.admin: Reading...\nmodule.infrahouse8-github-control.module.gha-admin.data.aws_iam_openid_connect_provider.github: Reading...\nmodule.infrahouse8-github-control.module.gha-admin.data.aws_iam_openid_connect_provider.github: Read complete after 0s [id=arn:aws:iam::303467602807:oidc-provider/token.actions.githubusercontent.com]\nmodule.infrahouse8-github-control.module.gha-admin.data.aws_iam_policy_document.github-trust: Reading...\nmodule.infrahouse8-github-control.module.gha-admin.data.aws_iam_policy_document.github-trust: Read complete after 0s [id=2229426295]\nmodule.infrahouse8-github-control.module.gha-admin.aws_iam_role.github: Refreshing state... [id=ih-tf-github-control-github]\nmodule.infrahouse8-github-control.module.gha-admin.module.state-manager.data.aws_iam_policy_document.assume: Reading...\nmodule.infrahouse8-github-control.module.gha-admin.data.aws_iam_policy_document.admin-trust: Reading...\nmodule.infrahouse8-github-control.module.gha-admin.data.aws_iam_policy_document.admin-trust: Read complete after 0s [id=91398067]\nmodule.infrahouse8-github-control.module.gha-admin.aws_iam_role.admin: Refreshing state... [id=ih-tf-github-control-admin]\nmodule.infrahouse8-github-control.module.gha-admin.module.state-manager.data.aws_iam_policy_document.assume: Read complete after 0s [id=262017685]\nmodule.infrahouse8-github-control.module.gha-admin.module.state-manager.aws_iam_role.state-manager: Refreshing state... [id=ih-tf-github-control-state-manager]\ndata.aws_secretsmanager_secrets.gh_secrets: Read complete after 0s [id=us-west-1]\nmodule.infrahouse8-github-control.module.gha-admin.data.aws_iam_policy_document.github-permissions: Reading...\nmodule.infrahouse8-github-control.module.gha-admin.data.aws_iam_policy_document.github-permissions: Read complete after 0s [id=2246898652]\nmodule.infrahouse8-github-control.module.gha-admin.aws_iam_policy.github: Refreshing state... [id=arn:aws:iam::303467602807:policy/ih-tf-github-control-github20231016152934873800000001]\ndata.aws_ssm_parameter.gh_secrets_namespace: Read complete after 0s [id=gh_secrets_namespace]\naws_secretsmanager_secret.codacy_api_token: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:303467602807:secret:_github_control__CODACY_PROJECT_TOKEN-fhlOS2]\naws_secretsmanager_secret.pypi_api_token: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:303467602807:secret:_github_control__PYPI_API_TOKEN-5N8UtG]\nmodule.infrahouse8-github-control.module.state-bucket.aws_s3_bucket.state-bucket: Refreshing state... [id=infrahouse-github-control-state]\nmodule.infrahouse8-github-control.module.gha-admin.aws_iam_role_policy_attachment.github: Refreshing state... [id=ih-tf-github-control-github-20231016152935026000000003]\ndata.aws_secretsmanager_secret_version.pypi_api_token: Reading...\ndata.aws_secretsmanager_secret_version.codacy_api_token: Reading...\nmodule.infrahouse8-github-control.module.gha-admin.data.aws_iam_policy.admin: Read complete after 1s [id=arn:aws:iam::aws:policy/AdministratorAccess]\nmodule.infrahouse8-github-control.module.gha-admin.aws_iam_role_policy_attachment.admin: Refreshing state... [id=ih-tf-github-control-admin-20231016152934892800000002]\ndata.aws_secretsmanager_secret_version.codacy_api_token: Read complete after 0s [id=arn:aws:secretsmanager:us-west-1:303467602807:secret:_github_control__CODACY_PROJECT_TOKEN-fhlOS2|AWSCURRENT]\ndata.aws_secretsmanager_secret_version.pypi_api_token: Read complete after 0s [id=arn:aws:secretsmanager:us-west-1:303467602807:secret:_github_control__PYPI_API_TOKEN-5N8UtG|AWSCURRENT]\nmodule.repos["terraform-aws-instance-profile"].github_repository.repo: Refreshing state... [id=terraform-aws-instance-profile]\nmodule.repos["aws-control-289256138624"].github_repository.repo: Refreshing state... [id=aws-control-289256138624]\nmodule.repos["terraform-aws-cloud-init"].github_repository.repo: Refreshing state... [id=terraform-aws-cloud-init]\nmodule.repos["terraform-aws-gha-admin"].github_repository.repo: Refreshing state... [id=terraform-aws-gha-admin]\nmodule.repos["terraform-aws-website-pod"].github_repository.repo: Refreshing state... [id=terraform-aws-website-pod]\nmodule.repos["aws-control"].github_repository.repo: Refreshing state... [id=aws-control]\nmodule.repos["infrahouse-toolkit"].github_repository.repo: Refreshing state... [id=infrahouse-toolkit]\nmodule.repos["terraform-aws-service-network"].github_repository.repo: Refreshing state... [id=terraform-aws-service-network]\nmodule.repos["infrahouse-com"].github_repository.repo: Refreshing state... [id=infrahouse-com]\nmodule.repos["aws-control-493370826424"].github_repository.repo: Refreshing state... [id=aws-control-493370826424]\nmodule.repos["aws-control-303467602807"].github_repository.repo: Refreshing state... [id=aws-control-303467602807]\nmodule.repos["puppet-code"].github_repository.repo: Refreshing state... [id=puppet-code]\nmodule.repos["terraform-aws-debian-repo"].github_repository.repo: Refreshing state... [id=terraform-aws-debian-repo]\nmodule.repos["infrahouse-website-infra"].github_repository.repo: Refreshing state... [id=infrahouse-website-infra]\nmodule.repos["terraform-aws-gh-identity-provider"].github_repository.repo: Refreshing state... [id=terraform-aws-gh-identity-provider]\nmodule.repos["proxysql-sandbox"].github_repository.repo: Refreshing state... [id=proxysql-sandbox]\nmodule.repos["terraform-aws-state-manager"].github_repository.repo: Refreshing state... [id=terraform-aws-state-manager]\nmodule.repos["terraform-aws-state-bucket"].github_repository.repo: Refreshing state... [id=terraform-aws-state-bucket]\nmodule.repos["cookiecutter-github-control"].github_repository.repo: Refreshing state... [id=cookiecutter-github-control]\nmodule.infrahouse8-github-control.module.state-bucket.aws_s3_bucket_versioning.enabled: Refreshing state... [id=infrahouse-github-control-state]\nmodule.infrahouse8-github-control.module.state-bucket.aws_s3_bucket_server_side_encryption_configuration.default: Refreshing state... [id=infrahouse-github-control-state]\nmodule.infrahouse8-github-control.module.state-bucket.aws_s3_bucket_public_access_block.public_access: Refreshing state... [id=infrahouse-github-control-state]\nmodule.infrahouse8-github-control.module.gha-admin.module.state-manager.data.aws_iam_policy_document.permissions_ro: Reading...\nmodule.infrahouse8-github-control.module.gha-admin.module.state-manager.data.aws_iam_policy_document.permissions_ro: Read complete after 0s [id=3098380055]\nmodule.infrahouse8-github-control.module.gha-admin.module.state-manager.data.aws_iam_policy_document.permissions_rw: Reading...\nmodule.infrahouse8-github-control.module.gha-admin.module.state-manager.data.aws_iam_policy_document.permissions_rw: Read complete after 0s [id=19153250]\nmodule.infrahouse8-github-control.module.gha-admin.module.state-manager.aws_iam_policy.permissions_ro: Refreshing state... [id=arn:aws:iam::289256138624:policy/ih-tf-github-control-state-manager-ro20231016152936860000000001]\nmodule.infrahouse8-github-control.module.gha-admin.module.state-manager.aws_iam_policy.permissions_rw: Refreshing state... [id=arn:aws:iam::289256138624:policy/ih-tf-github-control-state-manager-rw20231016152936864600000002]\nmodule.infrahouse8-github-control.module.gha-admin.module.state-manager.aws_iam_role_policy_attachment.state-manager-ro: Refreshing state... [id=ih-tf-github-control-state-manager-20231016152936987100000003]\nmodule.infrahouse8-github-control.module.gha-admin.module.state-manager.aws_iam_role_policy_attachment.state-manager-rw[0]: Refreshing state... [id=ih-tf-github-control-state-manager-20231016152937028600000004]\nmodule.repos["infrahouse-website-infra"].github_team_repository.dev: Refreshing state... [id=7332815:infrahouse-website-infra]\nmodule.repos["terraform-aws-website-pod"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-website-pod]\nmodule.repos["terraform-aws-service-network"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-service-network]\nmodule.repos["terraform-aws-cloud-init"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-cloud-init]\nmodule.repos["aws-control-303467602807"].github_team_repository.dev: Refreshing state... [id=7332815:aws-control-303467602807]\nmodule.repos["terraform-aws-state-manager"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-state-manager]\nmodule.repos["cookiecutter-github-control"].github_team_repository.dev: Refreshing state... [id=7332815:cookiecutter-github-control]\nmodule.repos["puppet-code"].github_team_repository.dev: Refreshing state... [id=7332815:puppet-code]\nmodule.repos["terraform-aws-gha-admin"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-gha-admin]\nmodule.repos["terraform-aws-state-bucket"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-state-bucket]\nmodule.repos["aws-control"].github_team_repository.dev: Refreshing state... [id=7332815:aws-control]\nmodule.repos["terraform-aws-debian-repo"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-debian-repo]\nmodule.repos["proxysql-sandbox"].github_team_repository.dev: Refreshing state... [id=7332815:proxysql-sandbox]\nmodule.repos["terraform-aws-gh-identity-provider"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-gh-identity-provider]\nmodule.repos["terraform-aws-instance-profile"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-instance-profile]\nmodule.repos["aws-control-493370826424"].github_team_repository.dev: Refreshing state... [id=7332815:aws-control-493370826424]\nmodule.repos["infrahouse-com"].github_team_repository.dev: Refreshing state... [id=7332815:infrahouse-com]\nmodule.repos["infrahouse-toolkit"].github_team_repository.dev: Refreshing state... [id=7332815:infrahouse-toolkit]\nmodule.repos["aws-control-289256138624"].github_team_repository.dev: Refreshing state... [id=7332815:aws-control-289256138624]\nmodule.repos["proxysql-sandbox"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=proxysql-sandbox:GH_TOKEN]\nmodule.repos["aws-control-303467602807"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=aws-control-303467602807:AWS_DEFAULT_REGION]\nmodule.repos["aws-control-289256138624"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=aws-control-289256138624:GH_TOKEN]\nmodule.repos["infrahouse-website-infra"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=infrahouse-website-infra:GH_TOKEN]\nmodule.repos["terraform-aws-debian-repo"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-debian-repo:GH_TOKEN]\nmodule.repos["aws-control-493370826424"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=aws-control-493370826424:AWS_DEFAULT_REGION]\nmodule.repos["terraform-aws-gha-admin"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-gha-admin:GH_TOKEN]\nmodule.repos["aws-control"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=aws-control:GH_TOKEN]\nmodule.repos["aws-control-493370826424"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=aws-control-493370826424:GH_TOKEN]\nmodule.repos["terraform-aws-state-manager"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-state-manager:GH_TOKEN]\nmodule.repos["infrahouse-toolkit"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=infrahouse-toolkit:AWS_DEFAULT_REGION]\nmodule.repos["terraform-aws-service-network"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-service-network:GH_TOKEN]\nmodule.repos["puppet-code"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=puppet-code:AWS_DEFAULT_REGION]\nmodule.repos["infrahouse-toolkit"].github_actions_secret.secret["CODACY_PROJECT_TOKEN"]: Refreshing state... [id=infrahouse-toolkit:CODACY_PROJECT_TOKEN]\nmodule.repos["puppet-code"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=puppet-code:GH_TOKEN]\nmodule.repos["aws-control"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=aws-control:AWS_DEFAULT_REGION]\nmodule.repos["aws-control-289256138624"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=aws-control-289256138624:AWS_DEFAULT_REGION]\nmodule.repos["infrahouse-website-infra"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=infrahouse-website-infra:AWS_DEFAULT_REGION]\nmodule.repos["terraform-aws-website-pod"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-website-pod:GH_TOKEN]\nmodule.repos["cookiecutter-github-control"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=cookiecutter-github-control:GH_TOKEN]\nmodule.repos["infrahouse-toolkit"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=infrahouse-toolkit:GH_TOKEN]\nmodule.repos["terraform-aws-gh-identity-provider"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-gh-identity-provider:GH_TOKEN]\nmodule.repos["infrahouse-toolkit"].github_actions_secret.secret["PYPI_API_TOKEN"]: Refreshing state... [id=infrahouse-toolkit:PYPI_API_TOKEN]\nmodule.repos["terraform-aws-cloud-init"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-cloud-init:GH_TOKEN]\nmodule.repos["infrahouse-com"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=infrahouse-com:GH_TOKEN]\nmodule.repos["aws-control-303467602807"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=aws-control-303467602807:GH_TOKEN]\nmodule.repos["terraform-aws-state-bucket"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-state-bucket:GH_TOKEN]\nmodule.repos["terraform-aws-instance-profile"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-instance-profile:GH_TOKEN]\nmodule.repos["infrahouse-com"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=infrahouse-com:AWS_DEFAULT_REGION]\n\nTerraform used the selected providers to generate the following execution\nplan. Resource actions are indicated with the following symbols:\n  + create\n\nTerraform will perform the following actions:\n\n  # module.repos["terraform-aws-ci-cd"].github_actions_secret.secret["GH_TOKEN"] will be created\n  + resource "github_actions_secret" "secret" {\n      + created_at      = (known after apply)\n      + id              = (known after apply)\n      + plaintext_value = (sensitive value)\n      + repository      = "terraform-aws-ci-cd"\n      + secret_name     = "GH_TOKEN"\n      + updated_at      = (known after apply)\n    }\n\n  # module.repos["terraform-aws-ci-cd"].github_repository.repo will be created\n  + resource "github_repository" "repo" {\n      + allow_auto_merge            = false\n      + allow_merge_commit          = true\n      + allow_rebase_merge          = true\n      + allow_squash_merge          = true\n      + archived                    = false\n      + default_branch              = (known after apply)\n      + delete_branch_on_merge      = false\n      + description                 = "Module that creates roles, state bucket, and dynamodb table for Terraform CI/CD."\n      + etag                        = (known after apply)\n      + full_name                   = (known after apply)\n      + git_clone_url               = (known after apply)\n      + has_issues                  = true\n      + html_url                    = (known after apply)\n      + http_clone_url              = (known after apply)\n      + id                          = (known after apply)\n      + merge_commit_message        = "PR_TITLE"\n      + merge_commit_title          = "MERGE_MESSAGE"\n      + name                        = "terraform-aws-ci-cd"\n      + node_id                     = (known after apply)\n      + primary_language            = (known after apply)\n      + private                     = (known after apply)\n      + repo_id                     = (known after apply)\n      + squash_merge_commit_message = "COMMIT_MESSAGES"\n      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"\n      + ssh_clone_url               = (known after apply)\n      + svn_url                     = (known after apply)\n      + topics                      = (known after apply)\n      + visibility                  = "public"\n    }\n\n  # module.repos["terraform-aws-ci-cd"].github_team_repository.dev will be created\n  + resource "github_team_repository" "dev" {\n      + etag       = (known after apply)\n      + id         = (known after apply)\n      + permission = "push"\n      + repository = "terraform-aws-ci-cd"\n      + team_id    = "7332815"\n    }\n\nPlan: 3 to add, 0 to change, 0 to destroy.\n\n\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\n\nSaved the plan to: tf.plan\n\nTo perform exactly these actions, run the following command to apply:\n    terraform apply "tf.plan"\n::debug::Terraform exited with code 0.\n::debug::stdout: module.infrahouse8-github-control.module.state-bucket.random_pet.suffix: Refreshing state... [id=infrahouse-github-control-state-polished-lioness]%0Adata.external.env: Reading...%0Adata.external.env: Read complete after 0s [id=-]%0Amodule.ih_8_repos["github-control"].github_repository.repo: Refreshing state... [id=github-control]%0Amodule.ih8_tf_template.github_repository.repo: Refreshing state... [id=terraform-template]%0Agithub_membership.infrahouse["akuzminsky"]: Refreshing state... [id=infrahouse:akuzminsky]%0Agithub_team.dev: Refreshing state... [id=7332815]%0Agithub_organization_settings.infrahouse: Refreshing state... [id=121984263]%0Amodule.ih_tf_template.github_repository.repo: Refreshing state... [id=terraform-template]%0Amodule.ih_8_repos["github-control"].github_branch_default.main: Refreshing state... [id=github-control]%0Amodule.ih_8_repos["github-control"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=github-control:GH_TOKEN]%0Amodule.ih_8_repos["github-control"].github_repository_collaborator.collaborators["akuzminsky"]: Refreshing state... [id=github-control:akuzminsky]%0Agithub_team_members.dev: Refreshing state... [id=7332815]%0Amodule.ih_8_repos["github-control"].github_branch_protection.main: Refreshing state... [id=BPR_kwDOI2vu7M4CAici]%0Amodule.ih_tf_template.github_team_repository.dev[0]: Refreshing state... [id=7332815:terraform-template]%0Amodule.infrahouse8-github-control.module.state-bucket.aws_dynamodb_table.terraform_locks: Refreshing state... [id=infrahouse-github-control-state-polished-lioness]%0Adata.aws_secretsmanager_secrets.gh_secrets: Reading...%0Adata.aws_ssm_parameter.gh_secrets_namespace: Reading...%0Amodule.infrahouse8-github-control.module.gha-admin.data.aws_iam_policy.admin: Reading...%0Amodule.infrahouse8-github-control.module.gha-admin.data.aws_iam_openid_connect_provider.github: Reading...%0Amodule.infrahouse8-github-control.module.gha-admin.data.aws_iam_openid_connect_provider.github: Read complete after 0s [id=arn:aws:iam::303467602807:oidc-provider/token.actions.githubusercontent.com]%0Amodule.infrahouse8-github-control.module.gha-admin.data.aws_iam_policy_document.github-trust: Reading...%0Amodule.infrahouse8-github-control.module.gha-admin.data.aws_iam_policy_document.github-trust: Read complete after 0s [id=2229426295]%0Amodule.infrahouse8-github-control.module.gha-admin.aws_iam_role.github: Refreshing state... [id=ih-tf-github-control-github]%0Amodule.infrahouse8-github-control.module.gha-admin.module.state-manager.data.aws_iam_policy_document.assume: Reading...%0Amodule.infrahouse8-github-control.module.gha-admin.data.aws_iam_policy_document.admin-trust: Reading...%0Amodule.infrahouse8-github-control.module.gha-admin.data.aws_iam_policy_document.admin-trust: Read complete after 0s [id=91398067]%0Amodule.infrahouse8-github-control.module.gha-admin.aws_iam_role.admin: Refreshing state... [id=ih-tf-github-control-admin]%0Amodule.infrahouse8-github-control.module.gha-admin.module.state-manager.data.aws_iam_policy_document.assume: Read complete after 0s [id=262017685]%0Amodule.infrahouse8-github-control.module.gha-admin.module.state-manager.aws_iam_role.state-manager: Refreshing state... [id=ih-tf-github-control-state-manager]%0Adata.aws_secretsmanager_secrets.gh_secrets: Read complete after 0s [id=us-west-1]%0Amodule.infrahouse8-github-control.module.gha-admin.data.aws_iam_policy_document.github-permissions: Reading...%0Amodule.infrahouse8-github-control.module.gha-admin.data.aws_iam_policy_document.github-permissions: Read complete after 0s [id=2246898652]%0Amodule.infrahouse8-github-control.module.gha-admin.aws_iam_policy.github: Refreshing state... [id=arn:aws:iam::303467602807:policy/ih-tf-github-control-github20231016152934873800000001]%0Adata.aws_ssm_parameter.gh_secrets_namespace: Read complete after 0s [id=gh_secrets_namespace]%0Aaws_secretsmanager_secret.codacy_api_token: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:303467602807:secret:_github_control__CODACY_PROJECT_TOKEN-fhlOS2]%0Aaws_secretsmanager_secret.pypi_api_token: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:303467602807:secret:_github_control__PYPI_API_TOKEN-5N8UtG]%0Amodule.infrahouse8-github-control.module.state-bucket.aws_s3_bucket.state-bucket: Refreshing state... [id=infrahouse-github-control-state]%0Amodule.infrahouse8-github-control.module.gha-admin.aws_iam_role_policy_attachment.github: Refreshing state... [id=ih-tf-github-control-github-20231016152935026000000003]%0Adata.aws_secretsmanager_secret_version.pypi_api_token: Reading...%0Adata.aws_secretsmanager_secret_version.codacy_api_token: Reading...%0Amodule.infrahouse8-github-control.module.gha-admin.data.aws_iam_policy.admin: Read complete after 1s [id=arn:aws:iam::aws:policy/AdministratorAccess]%0Amodule.infrahouse8-github-control.module.gha-admin.aws_iam_role_policy_attachment.admin: Refreshing state... [id=ih-tf-github-control-admin-20231016152934892800000002]%0Adata.aws_secretsmanager_secret_version.codacy_api_token: Read complete after 0s [id=arn:aws:secretsmanager:us-west-1:303467602807:secret:_github_control__CODACY_PROJECT_TOKEN-fhlOS2|AWSCURRENT]%0Adata.aws_secretsmanager_secret_version.pypi_api_token: Read complete after 0s [id=arn:aws:secretsmanager:us-west-1:303467602807:secret:_github_control__PYPI_API_TOKEN-5N8UtG|AWSCURRENT]%0Amodule.repos["terraform-aws-instance-profile"].github_repository.repo: Refreshing state... [id=terraform-aws-instance-profile]%0Amodule.repos["aws-control-289256138624"].github_repository.repo: Refreshing state... [id=aws-control-289256138624]%0Amodule.repos["terraform-aws-cloud-init"].github_repository.repo: Refreshing state... [id=terraform-aws-cloud-init]%0Amodule.repos["terraform-aws-gha-admin"].github_repository.repo: Refreshing state... [id=terraform-aws-gha-admin]%0Amodule.repos["terraform-aws-website-pod"].github_repository.repo: Refreshing state... [id=terraform-aws-website-pod]%0Amodule.repos["aws-control"].github_repository.repo: Refreshing state... [id=aws-control]%0Amodule.repos["infrahouse-toolkit"].github_repository.repo: Refreshing state... [id=infrahouse-toolkit]%0Amodule.repos["terraform-aws-service-network"].github_repository.repo: Refreshing state... [id=terraform-aws-service-network]%0Amodule.repos["infrahouse-com"].github_repository.repo: Refreshing state... [id=infrahouse-com]%0Amodule.repos["aws-control-493370826424"].github_repository.repo: Refreshing state... [id=aws-control-493370826424]%0Amodule.repos["aws-control-303467602807"].github_repository.repo: Refreshing state... [id=aws-control-303467602807]%0Amodule.repos["puppet-code"].github_repository.repo: Refreshing state... [id=puppet-code]%0Amodule.repos["terraform-aws-debian-repo"].github_repository.repo: Refreshing state... [id=terraform-aws-debian-repo]%0Amodule.repos["infrahouse-website-infra"].github_repository.repo: Refreshing state... [id=infrahouse-website-infra]%0Amodule.repos["terraform-aws-gh-identity-provider"].github_repository.repo: Refreshing state... [id=terraform-aws-gh-identity-provider]%0Amodule.repos["proxysql-sandbox"].github_repository.repo: Refreshing state... [id=proxysql-sandbox]%0Amodule.repos["terraform-aws-state-manager"].github_repository.repo: Refreshing state... [id=terraform-aws-state-manager]%0Amodule.repos["terraform-aws-state-bucket"].github_repository.repo: Refreshing state... [id=terraform-aws-state-bucket]%0Amodule.repos["cookiecutter-github-control"].github_repository.repo: Refreshing state... [id=cookiecutter-github-control]%0Amodule.infrahouse8-github-control.module.state-bucket.aws_s3_bucket_versioning.enabled: Refreshing state... [id=infrahouse-github-control-state]%0Amodule.infrahouse8-github-control.module.state-bucket.aws_s3_bucket_server_side_encryption_configuration.default: Refreshing state... [id=infrahouse-github-control-state]%0Amodule.infrahouse8-github-control.module.state-bucket.aws_s3_bucket_public_access_block.public_access: Refreshing state... [id=infrahouse-github-control-state]%0Amodule.infrahouse8-github-control.module.gha-admin.module.state-manager.data.aws_iam_policy_document.permissions_ro: Reading...%0Amodule.infrahouse8-github-control.module.gha-admin.module.state-manager.data.aws_iam_policy_document.permissions_ro: Read complete after 0s [id=3098380055]%0Amodule.infrahouse8-github-control.module.gha-admin.module.state-manager.data.aws_iam_policy_document.permissions_rw: Reading...%0Amodule.infrahouse8-github-control.module.gha-admin.module.state-manager.data.aws_iam_policy_document.permissions_rw: Read complete after 0s [id=19153250]%0Amodule.infrahouse8-github-control.module.gha-admin.module.state-manager.aws_iam_policy.permissions_ro: Refreshing state... [id=arn:aws:iam::289256138624:policy/ih-tf-github-control-state-manager-ro20231016152936860000000001]%0Amodule.infrahouse8-github-control.module.gha-admin.module.state-manager.aws_iam_policy.permissions_rw: Refreshing state... [id=arn:aws:iam::289256138624:policy/ih-tf-github-control-state-manager-rw20231016152936864600000002]%0Amodule.infrahouse8-github-control.module.gha-admin.module.state-manager.aws_iam_role_policy_attachment.state-manager-ro: Refreshing state... [id=ih-tf-github-control-state-manager-20231016152936987100000003]%0Amodule.infrahouse8-github-control.module.gha-admin.module.state-manager.aws_iam_role_policy_attachment.state-manager-rw[0]: Refreshing state... [id=ih-tf-github-control-state-manager-20231016152937028600000004]%0Amodule.repos["infrahouse-website-infra"].github_team_repository.dev: Refreshing state... [id=7332815:infrahouse-website-infra]%0Amodule.repos["terraform-aws-website-pod"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-website-pod]%0Amodule.repos["terraform-aws-service-network"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-service-network]%0Amodule.repos["terraform-aws-cloud-init"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-cloud-init]%0Amodule.repos["aws-control-303467602807"].github_team_repository.dev: Refreshing state... [id=7332815:aws-control-303467602807]%0Amodule.repos["terraform-aws-state-manager"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-state-manager]%0Amodule.repos["cookiecutter-github-control"].github_team_repository.dev: Refreshing state... [id=7332815:cookiecutter-github-control]%0Amodule.repos["puppet-code"].github_team_repository.dev: Refreshing state... [id=7332815:puppet-code]%0Amodule.repos["terraform-aws-gha-admin"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-gha-admin]%0Amodule.repos["terraform-aws-state-bucket"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-state-bucket]%0Amodule.repos["aws-control"].github_team_repository.dev: Refreshing state... [id=7332815:aws-control]%0Amodule.repos["terraform-aws-debian-repo"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-debian-repo]%0Amodule.repos["proxysql-sandbox"].github_team_repository.dev: Refreshing state... [id=7332815:proxysql-sandbox]%0Amodule.repos["terraform-aws-gh-identity-provider"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-gh-identity-provider]%0Amodule.repos["terraform-aws-instance-profile"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-instance-profile]%0Amodule.repos["aws-control-493370826424"].github_team_repository.dev: Refreshing state... [id=7332815:aws-control-493370826424]%0Amodule.repos["infrahouse-com"].github_team_repository.dev: Refreshing state... [id=7332815:infrahouse-com]%0Amodule.repos["infrahouse-toolkit"].github_team_repository.dev: Refreshing state... [id=7332815:infrahouse-toolkit]%0Amodule.repos["aws-control-289256138624"].github_team_repository.dev: Refreshing state... [id=7332815:aws-control-289256138624]%0Amodule.repos["proxysql-sandbox"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=proxysql-sandbox:GH_TOKEN]%0Amodule.repos["aws-control-303467602807"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=aws-control-303467602807:AWS_DEFAULT_REGION]%0Amodule.repos["aws-control-289256138624"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=aws-control-289256138624:GH_TOKEN]%0Amodule.repos["infrahouse-website-infra"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=infrahouse-website-infra:GH_TOKEN]%0Amodule.repos["terraform-aws-debian-repo"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-debian-repo:GH_TOKEN]%0Amodule.repos["aws-control-493370826424"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=aws-control-493370826424:AWS_DEFAULT_REGION]%0Amodule.repos["terraform-aws-gha-admin"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-gha-admin:GH_TOKEN]%0Amodule.repos["aws-control"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=aws-control:GH_TOKEN]%0Amodule.repos["aws-control-493370826424"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=aws-control-493370826424:GH_TOKEN]%0Amodule.repos["terraform-aws-state-manager"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-state-manager:GH_TOKEN]%0Amodule.repos["infrahouse-toolkit"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=infrahouse-toolkit:AWS_DEFAULT_REGION]%0Amodule.repos["terraform-aws-service-network"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-service-network:GH_TOKEN]%0Amodule.repos["puppet-code"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=puppet-code:AWS_DEFAULT_REGION]%0Amodule.repos["infrahouse-toolkit"].github_actions_secret.secret["CODACY_PROJECT_TOKEN"]: Refreshing state... [id=infrahouse-toolkit:CODACY_PROJECT_TOKEN]%0Amodule.repos["puppet-code"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=puppet-code:GH_TOKEN]%0Amodule.repos["aws-control"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=aws-control:AWS_DEFAULT_REGION]%0Amodule.repos["aws-control-289256138624"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=aws-control-289256138624:AWS_DEFAULT_REGION]%0Amodule.repos["infrahouse-website-infra"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=infrahouse-website-infra:AWS_DEFAULT_REGION]%0Amodule.repos["terraform-aws-website-pod"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-website-pod:GH_TOKEN]%0Amodule.repos["cookiecutter-github-control"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=cookiecutter-github-control:GH_TOKEN]%0Amodule.repos["infrahouse-toolkit"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=infrahouse-toolkit:GH_TOKEN]%0Amodule.repos["terraform-aws-gh-identity-provider"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-gh-identity-provider:GH_TOKEN]%0Amodule.repos["infrahouse-toolkit"].github_actions_secret.secret["PYPI_API_TOKEN"]: Refreshing state... [id=infrahouse-toolkit:PYPI_API_TOKEN]%0Amodule.repos["terraform-aws-cloud-init"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-cloud-init:GH_TOKEN]%0Amodule.repos["infrahouse-com"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=infrahouse-com:GH_TOKEN]%0Amodule.repos["aws-control-303467602807"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=aws-control-303467602807:GH_TOKEN]%0Amodule.repos["terraform-aws-state-bucket"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-state-bucket:GH_TOKEN]%0Amodule.repos["terraform-aws-instance-profile"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-instance-profile:GH_TOKEN]%0Amodule.repos["infrahouse-com"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=infrahouse-com:AWS_DEFAULT_REGION]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # module.repos["terraform-aws-ci-cd"].github_actions_secret.secret["GH_TOKEN"] will be created%0A  + resource "github_actions_secret" "secret" {%0A      + created_at      = (known after apply)%0A      + id              = (known after apply)%0A      + plaintext_value = (sensitive value)%0A      + repository      = "terraform-aws-ci-cd"%0A      + secret_name     = "GH_TOKEN"%0A      + updated_at      = (known after apply)%0A    }%0A%0A  # module.repos["terraform-aws-ci-cd"].github_repository.repo will be created%0A  + resource "github_repository" "repo" {%0A      + allow_auto_merge            = false%0A      + allow_merge_commit          = true%0A      + allow_rebase_merge          = true%0A      + allow_squash_merge          = true%0A      + archived                    = false%0A      + default_branch              = (known after apply)%0A      + delete_branch_on_merge      = false%0A      + description                 = "Module that creates roles, state bucket, and dynamodb table for Terraform CI/CD."%0A      + etag                        = (known after apply)%0A      + full_name                   = (known after apply)%0A      + git_clone_url               = (known after apply)%0A      + has_issues                  = true%0A      + html_url                    = (known after apply)%0A      + http_clone_url              = (known after apply)%0A      + id                          = (known after apply)%0A      + merge_commit_message        = "PR_TITLE"%0A      + merge_commit_title          = "MERGE_MESSAGE"%0A      + name                        = "terraform-aws-ci-cd"%0A      + node_id                     = (known after apply)%0A      + primary_language            = (known after apply)%0A      + private                     = (known after apply)%0A      + repo_id                     = (known after apply)%0A      + squash_merge_commit_message = "COMMIT_MESSAGES"%0A      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"%0A      + ssh_clone_url               = (known after apply)%0A      + svn_url                     = (known after apply)%0A      + topics                      = (known after apply)%0A      + visibility                  = "public"%0A    }%0A%0A  # module.repos["terraform-aws-ci-cd"].github_team_repository.dev will be created%0A  + resource "github_team_repository" "dev" {%0A      + etag       = (known after apply)%0A      + id         = (known after apply)%0A      + permission = "push"%0A      + repository = "terraform-aws-ci-cd"%0A      + team_id    = "7332815"%0A    }%0A%0APlan: 3 to add, 0 to change, 0 to destroy.%0A%0A\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500%0A%0ASaved the plan to: tf.plan%0A%0ATo perform exactly these actions, run the following command to apply:%0A    terraform apply "tf.plan"%0A\n::debug::stderr:\n::debug::exitcode: 0\n-expected_result5] PASSED
infrahouse_toolkit/terraform/tests/github_pr/test_find_comment_by_backend.py::test_find_comment_by_backend 
# State **`s3://foo-bucket/path/to/key.state`**
## Affected resources counts

|  Success  |  Add   |  Change   |  Destroy   |
|:---------:|:-------|:----------|:-----------|
|     ❌     | ❔      | ❔         | ❔          |
## Affected resources by action

|  Action  | Resources                                                                |
|:--------:|:-------------------------------------------------------------------------|
|    🟢     | `module.repos["test"].github_repository.repo`                            |
|    🟢     | `module.repos["test"].github_team_repository.dev`                        |
|    🟡     | `module.repos["infrahouse-toolkit"].github_repository.repo`              |
|    🔴     | `module.repos["cookiecutter-github-control"].github_repository.repo`     |
|    🔴     | `module.repos["cookiecutter-github-control"].github_team_repository.dev` |
<details>
<summary>STDOUT</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.repos["cookiecutter-github-control"].github_repository.repo will be destroyed
  # (because module.repos["cookiecutter-github-control"] is not in configuration)
  - resource "github_repository" "repo" {
      - allow_auto_merge            = false -> null
      - allow_merge_commit          = true -> null
      - allow_rebase_merge          = true -> null
      - allow_squash_merge          = true -> null
      - allow_update_branch         = false -> null
      - archived                    = false -> null
      - default_branch              = "main" -> null
      - delete_branch_on_merge      = false -> null
      - description                 = "Template for a GitHub Control repository" -> null
      - etag                        = "W/\"8b4a792bc1474d381caaa63b76668993b4adc42ae76ed53d6886d8562ebb0c67\"" -> null
      - full_name                   = "infrahouse/cookiecutter-github-control" -> null
      - git_clone_url               = "git://github.com/infrahouse/cookiecutter-github-control.git" -> null
      - has_discussions             = false -> null
      - has_downloads               = false -> null
      - has_issues                  = true -> null
      - has_projects                = false -> null
      - has_wiki                    = false -> null
      - html_url                    = "https://github.com/infrahouse/cookiecutter-github-control" -> null
      - http_clone_url              = "https://github.com/infrahouse/cookiecutter-github-control.git" -> null
      - id                          = "cookiecutter-github-control" -> null
      - is_template                 = false -> null
      - merge_commit_message        = "PR_TITLE" -> null
      - merge_commit_title          = "MERGE_MESSAGE" -> null
      - name                        = "cookiecutter-github-control" -> null
      - node_id                     = "R_kgDOI528zg" -> null
      - private                     = false -> null
      - repo_id                     = 597540046 -> null
      - squash_merge_commit_message = "COMMIT_MESSAGES" -> null
      - squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> null
      - ssh_clone_url               = "git@github.com:infrahouse/cookiecutter-github-control.git" -> null
      - svn_url                     = "https://github.com/infrahouse/cookiecutter-github-control" -> null
      - topics                      = [] -> null
      - visibility                  = "public" -> null
      - vulnerability_alerts        = false -> null

      - security_and_analysis {

          - secret_scanning {
              - status = "disabled" -> null
            }

          - secret_scanning_push_protection {
              - status = "disabled" -> null
            }
        }
    }

  # module.repos["cookiecutter-github-control"].github_team_repository.dev will be destroyed
  # (because module.repos["cookiecutter-github-control"] is not in configuration)
  - resource "github_team_repository" "dev" {
      - etag       = "W/\"8043f81b19693f6c1a72d21bb8dc03859c98bf78bfbe79782bfe13fa813992ca\"" -> null
      - id         = "7332815:cookiecutter-github-control" -> null
      - permission = "push" -> null
      - repository = "cookiecutter-github-control" -> null
      - team_id    = "7332815" -> null
    }

  # module.repos["infrahouse-toolkit"].github_repository.repo will be updated in-place
  ~ resource "github_repository" "repo" {
      ~ description                 = "InfraHouse Toolkit" -> "InfraHouse Toolkit1"
        id                          = "infrahouse-toolkit"
        name                        = "infrahouse-toolkit"
        # (31 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repos["test"].github_repository.repo will be created
  + resource "github_repository" "repo" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = false
      + description                 = "Template for a GitHub Control repository"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = true
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "test"
      + node_id                     = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + visibility                  = "public"

      + security_and_analysis {
          + advanced_security {
              + status = (known after apply)
            }

          + secret_scanning {
              + status = (known after apply)
            }

          + secret_scanning_push_protection {
              + status = (known after apply)
            }
        }
    }

  # module.repos["test"].github_team_repository.dev will be created
  + resource "github_team_repository" "dev" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "test"
      + team_id    = "7332815"
    }

Plan: 2 to add, 1 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
```
</details>
<details>
<summary>STDERR</summary>

```no output```
</details>
<details><summary><i>metadata</i></summary>
<p>
```eyJzMzovL2Zvby1idWNrZXQvcGF0aC90by9rZXkuc3RhdGUiOiB7InN1Y2Nlc3MiOiBmYWxzZSwgInN0ZG91dCI6ICJUZXJyYWZvcm0gdXNlZCB0aGUgc2VsZWN0ZWQgcHJvdmlkZXJzIHRvIGdlbmVyYXRlIHRoZSBmb2xsb3dpbmcgZXhlY3V0aW9uXG5wbGFuLiBSZXNvdXJjZSBhY3Rpb25zIGFyZSBpbmRpY2F0ZWQgd2l0aCB0aGUgZm9sbG93aW5nIHN5bWJvbHM6XG4gICsgY3JlYXRlXG4gIH4gdXBkYXRlIGluLXBsYWNlXG4gIC0gZGVzdHJveVxuXG5UZXJyYWZvcm0gd2lsbCBwZXJmb3JtIHRoZSBmb2xsb3dpbmcgYWN0aW9uczpcblxuICAjIG1vZHVsZS5yZXBvc1tcImNvb2tpZWN1dHRlci1naXRodWItY29udHJvbFwiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvIHdpbGwgYmUgZGVzdHJveWVkXG4gICMgKGJlY2F1c2UgbW9kdWxlLnJlcG9zW1wiY29va2llY3V0dGVyLWdpdGh1Yi1jb250cm9sXCJdIGlzIG5vdCBpbiBjb25maWd1cmF0aW9uKVxuICAtIHJlc291cmNlIFwiZ2l0aHViX3JlcG9zaXRvcnlcIiBcInJlcG9cIiB7XG4gICAgICAtIGFsbG93X2F1dG9fbWVyZ2UgICAgICAgICAgICA9IGZhbHNlIC0+IG51bGxcbiAgICAgIC0gYWxsb3dfbWVyZ2VfY29tbWl0ICAgICAgICAgID0gdHJ1ZSAtPiBudWxsXG4gICAgICAtIGFsbG93X3JlYmFzZV9tZXJnZSAgICAgICAgICA9IHRydWUgLT4gbnVsbFxuICAgICAgLSBhbGxvd19zcXVhc2hfbWVyZ2UgICAgICAgICAgPSB0cnVlIC0+IG51bGxcbiAgICAgIC0gYWxsb3dfdXBkYXRlX2JyYW5jaCAgICAgICAgID0gZmFsc2UgLT4gbnVsbFxuICAgICAgLSBhcmNoaXZlZCAgICAgICAgICAgICAgICAgICAgPSBmYWxzZSAtPiBudWxsXG4gICAgICAtIGRlZmF1bHRfYnJhbmNoICAgICAgICAgICAgICA9IFwibWFpblwiIC0+IG51bGxcbiAgICAgIC0gZGVsZXRlX2JyYW5jaF9vbl9tZXJnZSAgICAgID0gZmFsc2UgLT4gbnVsbFxuICAgICAgLSBkZXNjcmlwdGlvbiAgICAgICAgICAgICAgICAgPSBcIlRlbXBsYXRlIGZvciBhIEdpdEh1YiBDb250cm9sIHJlcG9zaXRvcnlcIiAtPiBudWxsXG4gICAgICAtIGV0YWcgICAgICAgICAgICAgICAgICAgICAgICA9IFwiVy9cXFwiOGI0YTc5MmJjMTQ3NGQzODFjYWFhNjNiNzY2Njg5OTNiNGFkYzQyYWU3NmVkNTNkNjg4NmQ4NTYyZWJiMGM2N1xcXCJcIiAtPiBudWxsXG4gICAgICAtIGZ1bGxfbmFtZSAgICAgICAgICAgICAgICAgICA9IFwiaW5mcmFob3VzZS9jb29raWVjdXR0ZXItZ2l0aHViLWNvbnRyb2xcIiAtPiBudWxsXG4gICAgICAtIGdpdF9jbG9uZV91cmwgICAgICAgICAgICAgICA9IFwiZ2l0Oi8vZ2l0aHViLmNvbS9pbmZyYWhvdXNlL2Nvb2tpZWN1dHRlci1naXRodWItY29udHJvbC5naXRcIiAtPiBudWxsXG4gICAgICAtIGhhc19kaXNjdXNzaW9ucyAgICAgICAgICAgICA9IGZhbHNlIC0+IG51bGxcbiAgICAgIC0gaGFzX2Rvd25sb2FkcyAgICAgICAgICAgICAgID0gZmFsc2UgLT4gbnVsbFxuICAgICAgLSBoYXNfaXNzdWVzICAgICAgICAgICAgICAgICAgPSB0cnVlIC0+IG51bGxcbiAgICAgIC0gaGFzX3Byb2plY3RzICAgICAgICAgICAgICAgID0gZmFsc2UgLT4gbnVsbFxuICAgICAgLSBoYXNfd2lraSAgICAgICAgICAgICAgICAgICAgPSBmYWxzZSAtPiBudWxsXG4gICAgICAtIGh0bWxfdXJsICAgICAgICAgICAgICAgICAgICA9IFwiaHR0cHM6Ly9naXRodWIuY29tL2luZnJhaG91c2UvY29va2llY3V0dGVyLWdpdGh1Yi1jb250cm9sXCIgLT4gbnVsbFxuICAgICAgLSBodHRwX2Nsb25lX3VybCAgICAgICAgICAgICAgPSBcImh0dHBzOi8vZ2l0aHViLmNvbS9pbmZyYWhvdXNlL2Nvb2tpZWN1dHRlci1naXRodWItY29udHJvbC5naXRcIiAtPiBudWxsXG4gICAgICAtIGlkICAgICAgICAgICAgICAgICAgICAgICAgICA9IFwiY29va2llY3V0dGVyLWdpdGh1Yi1jb250cm9sXCIgLT4gbnVsbFxuICAgICAgLSBpc190ZW1wbGF0ZSAgICAgICAgICAgICAgICAgPSBmYWxzZSAtPiBudWxsXG4gICAgICAtIG1lcmdlX2NvbW1pdF9tZXNzYWdlICAgICAgICA9IFwiUFJfVElUTEVcIiAtPiBudWxsXG4gICAgICAtIG1lcmdlX2NvbW1pdF90aXRsZSAgICAgICAgICA9IFwiTUVSR0VfTUVTU0FHRVwiIC0+IG51bGxcbiAgICAgIC0gbmFtZSAgICAgICAgICAgICAgICAgICAgICAgID0gXCJjb29raWVjdXR0ZXItZ2l0aHViLWNvbnRyb2xcIiAtPiBudWxsXG4gICAgICAtIG5vZGVfaWQgICAgICAgICAgICAgICAgICAgICA9IFwiUl9rZ0RPSTUyOHpnXCIgLT4gbnVsbFxuICAgICAgLSBwcml2YXRlICAgICAgICAgICAgICAgICAgICAgPSBmYWxzZSAtPiBudWxsXG4gICAgICAtIHJlcG9faWQgICAgICAgICAgICAgICAgICAgICA9IDU5NzU0MDA0NiAtPiBudWxsXG4gICAgICAtIHNxdWFzaF9tZXJnZV9jb21taXRfbWVzc2FnZSA9IFwiQ09NTUlUX01FU1NBR0VTXCIgLT4gbnVsbFxuICAgICAgLSBzcXVhc2hfbWVyZ2VfY29tbWl0X3RpdGxlICAgPSBcIkNPTU1JVF9PUl9QUl9USVRMRVwiIC0+IG51bGxcbiAgICAgIC0gc3NoX2Nsb25lX3VybCAgICAgICAgICAgICAgID0gXCJnaXRAZ2l0aHViLmNvbTppbmZyYWhvdXNlL2Nvb2tpZWN1dHRlci1naXRodWItY29udHJvbC5naXRcIiAtPiBudWxsXG4gICAgICAtIHN2bl91cmwgICAgICAgICAgICAgICAgICAgICA9IFwiaHR0cHM6Ly9naXRodWIuY29tL2luZnJhaG91c2UvY29va2llY3V0dGVyLWdpdGh1Yi1jb250cm9sXCIgLT4gbnVsbFxuICAgICAgLSB0b3BpY3MgICAgICAgICAgICAgICAgICAgICAgPSBbXSAtPiBudWxsXG4gICAgICAtIHZpc2liaWxpdHkgICAgICAgICAgICAgICAgICA9IFwicHVibGljXCIgLT4gbnVsbFxuICAgICAgLSB2dWxuZXJhYmlsaXR5X2FsZXJ0cyAgICAgICAgPSBmYWxzZSAtPiBudWxsXG5cbiAgICAgIC0gc2VjdXJpdHlfYW5kX2FuYWx5c2lzIHtcblxuICAgICAgICAgIC0gc2VjcmV0X3NjYW5uaW5nIHtcbiAgICAgICAgICAgICAgLSBzdGF0dXMgPSBcImRpc2FibGVkXCIgLT4gbnVsbFxuICAgICAgICAgICAgfVxuXG4gICAgICAgICAgLSBzZWNyZXRfc2Nhbm5pbmdfcHVzaF9wcm90ZWN0aW9uIHtcbiAgICAgICAgICAgICAgLSBzdGF0dXMgPSBcImRpc2FibGVkXCIgLT4gbnVsbFxuICAgICAgICAgICAgfVxuICAgICAgICB9XG4gICAgfVxuXG4gICMgbW9kdWxlLnJlcG9zW1wiY29va2llY3V0dGVyLWdpdGh1Yi1jb250cm9sXCJdLmdpdGh1Yl90ZWFtX3JlcG9zaXRvcnkuZGV2IHdpbGwgYmUgZGVzdHJveWVkXG4gICMgKGJlY2F1c2UgbW9kdWxlLnJlcG9zW1wiY29va2llY3V0dGVyLWdpdGh1Yi1jb250cm9sXCJdIGlzIG5vdCBpbiBjb25maWd1cmF0aW9uKVxuICAtIHJlc291cmNlIFwiZ2l0aHViX3RlYW1fcmVwb3NpdG9yeVwiIFwiZGV2XCIge1xuICAgICAgLSBldGFnICAgICAgID0gXCJXL1xcXCI4MDQzZjgxYjE5NjkzZjZjMWE3MmQyMWJiOGRjMDM4NTljOThiZjc4YmZiZTc5NzgyYmZlMTNmYTgxMzk5MmNhXFxcIlwiIC0+IG51bGxcbiAgICAgIC0gaWQgICAgICAgICA9IFwiNzMzMjgxNTpjb29raWVjdXR0ZXItZ2l0aHViLWNvbnRyb2xcIiAtPiBudWxsXG4gICAgICAtIHBlcm1pc3Npb24gPSBcInB1c2hcIiAtPiBudWxsXG4gICAgICAtIHJlcG9zaXRvcnkgPSBcImNvb2tpZWN1dHRlci1naXRodWItY29udHJvbFwiIC0+IG51bGxcbiAgICAgIC0gdGVhbV9pZCAgICA9IFwiNzMzMjgxNVwiIC0+IG51bGxcbiAgICB9XG5cbiAgIyBtb2R1bGUucmVwb3NbXCJpbmZyYWhvdXNlLXRvb2xraXRcIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbyB3aWxsIGJlIHVwZGF0ZWQgaW4tcGxhY2VcbiAgfiByZXNvdXJjZSBcImdpdGh1Yl9yZXBvc2l0b3J5XCIgXCJyZXBvXCIge1xuICAgICAgfiBkZXNjcmlwdGlvbiAgICAgICAgICAgICAgICAgPSBcIkluZnJhSG91c2UgVG9vbGtpdFwiIC0+IFwiSW5mcmFIb3VzZSBUb29sa2l0MVwiXG4gICAgICAgIGlkICAgICAgICAgICAgICAgICAgICAgICAgICA9IFwiaW5mcmFob3VzZS10b29sa2l0XCJcbiAgICAgICAgbmFtZSAgICAgICAgICAgICAgICAgICAgICAgID0gXCJpbmZyYWhvdXNlLXRvb2xraXRcIlxuICAgICAgICAjICgzMSB1bmNoYW5nZWQgYXR0cmlidXRlcyBoaWRkZW4pXG5cbiAgICAgICAgIyAoMSB1bmNoYW5nZWQgYmxvY2sgaGlkZGVuKVxuICAgIH1cblxuICAjIG1vZHVsZS5yZXBvc1tcInRlc3RcIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbyB3aWxsIGJlIGNyZWF0ZWRcbiAgKyByZXNvdXJjZSBcImdpdGh1Yl9yZXBvc2l0b3J5XCIgXCJyZXBvXCIge1xuICAgICAgKyBhbGxvd19hdXRvX21lcmdlICAgICAgICAgICAgPSBmYWxzZVxuICAgICAgKyBhbGxvd19tZXJnZV9jb21taXQgICAgICAgICAgPSB0cnVlXG4gICAgICArIGFsbG93X3JlYmFzZV9tZXJnZSAgICAgICAgICA9IHRydWVcbiAgICAgICsgYWxsb3dfc3F1YXNoX21lcmdlICAgICAgICAgID0gdHJ1ZVxuICAgICAgKyBhcmNoaXZlZCAgICAgICAgICAgICAgICAgICAgPSBmYWxzZVxuICAgICAgKyBkZWZhdWx0X2JyYW5jaCAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGRlbGV0ZV9icmFuY2hfb25fbWVyZ2UgICAgICA9IGZhbHNlXG4gICAgICArIGRlc2NyaXB0aW9uICAgICAgICAgICAgICAgICA9IFwiVGVtcGxhdGUgZm9yIGEgR2l0SHViIENvbnRyb2wgcmVwb3NpdG9yeVwiXG4gICAgICArIGV0YWcgICAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgZnVsbF9uYW1lICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBnaXRfY2xvbmVfdXJsICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGhhc19pc3N1ZXMgICAgICAgICAgICAgICAgICA9IHRydWVcbiAgICAgICsgaHRtbF91cmwgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBodHRwX2Nsb25lX3VybCAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGlkICAgICAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgbWVyZ2VfY29tbWl0X21lc3NhZ2UgICAgICAgID0gXCJQUl9USVRMRVwiXG4gICAgICArIG1lcmdlX2NvbW1pdF90aXRsZSAgICAgICAgICA9IFwiTUVSR0VfTUVTU0FHRVwiXG4gICAgICArIG5hbWUgICAgICAgICAgICAgICAgICAgICAgICA9IFwidGVzdFwiXG4gICAgICArIG5vZGVfaWQgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgcHJpdmF0ZSAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyByZXBvX2lkICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHNxdWFzaF9tZXJnZV9jb21taXRfbWVzc2FnZSA9IFwiQ09NTUlUX01FU1NBR0VTXCJcbiAgICAgICsgc3F1YXNoX21lcmdlX2NvbW1pdF90aXRsZSAgID0gXCJDT01NSVRfT1JfUFJfVElUTEVcIlxuICAgICAgKyBzc2hfY2xvbmVfdXJsICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHN2bl91cmwgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgdmlzaWJpbGl0eSAgICAgICAgICAgICAgICAgID0gXCJwdWJsaWNcIlxuXG4gICAgICArIHNlY3VyaXR5X2FuZF9hbmFseXNpcyB7XG4gICAgICAgICAgKyBhZHZhbmNlZF9zZWN1cml0eSB7XG4gICAgICAgICAgICAgICsgc3RhdHVzID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgICAgICAgfVxuXG4gICAgICAgICAgKyBzZWNyZXRfc2Nhbm5pbmcge1xuICAgICAgICAgICAgICArIHN0YXR1cyA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICAgICAgIH1cblxuICAgICAgICAgICsgc2VjcmV0X3NjYW5uaW5nX3B1c2hfcHJvdGVjdGlvbiB7XG4gICAgICAgICAgICAgICsgc3RhdHVzID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgICAgICAgfVxuICAgICAgICB9XG4gICAgfVxuXG4gICMgbW9kdWxlLnJlcG9zW1widGVzdFwiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldiB3aWxsIGJlIGNyZWF0ZWRcbiAgKyByZXNvdXJjZSBcImdpdGh1Yl90ZWFtX3JlcG9zaXRvcnlcIiBcImRldlwiIHtcbiAgICAgICsgZXRhZyAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgaWQgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgcGVybWlzc2lvbiA9IFwicHVzaFwiXG4gICAgICArIHJlcG9zaXRvcnkgPSBcInRlc3RcIlxuICAgICAgKyB0ZWFtX2lkICAgID0gXCI3MzMyODE1XCJcbiAgICB9XG5cblBsYW46IDIgdG8gYWRkLCAxIHRvIGNoYW5nZSwgMiB0byBkZXN0cm95LlxuXG5cdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcblxuU2F2ZWQgdGhlIHBsYW4gdG86IHRmLnBsYW5cblxuVG8gcGVyZm9ybSBleGFjdGx5IHRoZXNlIGFjdGlvbnMsIHJ1biB0aGUgZm9sbG93aW5nIGNvbW1hbmQgdG8gYXBwbHk6XG4gICAgdGVycmFmb3JtIGFwcGx5IFwidGYucGxhblwiIiwgInN0ZGVyciI6IG51bGwsICJhZGQiOiAyLCAiY2hhbmdlIjogMSwgImRlc3Ryb3kiOiAyfX0=```
</p></details>
PASSED
infrahouse_toolkit/terraform/tests/github_pr/test_init.py::test_init 
# State **`s3://foo-bucket/path/to/key.state`**
## Affected resources counts

|  Success  |  Add   |  Change   |  Destroy   |
|:---------:|:-------|:----------|:-----------|
|     ❌     | ❔      | ❔         | ❔          |
## Affected resources by action

|  Action  | Resources                                                                |
|:--------:|:-------------------------------------------------------------------------|
|    🟢     | `module.repos["test"].github_repository.repo`                            |
|    🟢     | `module.repos["test"].github_team_repository.dev`                        |
|    🟡     | `module.repos["infrahouse-toolkit"].github_repository.repo`              |
|    🔴     | `module.repos["cookiecutter-github-control"].github_repository.repo`     |
|    🔴     | `module.repos["cookiecutter-github-control"].github_team_repository.dev` |
<details>
<summary>STDOUT</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.repos["cookiecutter-github-control"].github_repository.repo will be destroyed
  # (because module.repos["cookiecutter-github-control"] is not in configuration)
  - resource "github_repository" "repo" {
      - allow_auto_merge            = false -> null
      - allow_merge_commit          = true -> null
      - allow_rebase_merge          = true -> null
      - allow_squash_merge          = true -> null
      - allow_update_branch         = false -> null
      - archived                    = false -> null
      - default_branch              = "main" -> null
      - delete_branch_on_merge      = false -> null
      - description                 = "Template for a GitHub Control repository" -> null
      - etag                        = "W/\"8b4a792bc1474d381caaa63b76668993b4adc42ae76ed53d6886d8562ebb0c67\"" -> null
      - full_name                   = "infrahouse/cookiecutter-github-control" -> null
      - git_clone_url               = "git://github.com/infrahouse/cookiecutter-github-control.git" -> null
      - has_discussions             = false -> null
      - has_downloads               = false -> null
      - has_issues                  = true -> null
      - has_projects                = false -> null
      - has_wiki                    = false -> null
      - html_url                    = "https://github.com/infrahouse/cookiecutter-github-control" -> null
      - http_clone_url              = "https://github.com/infrahouse/cookiecutter-github-control.git" -> null
      - id                          = "cookiecutter-github-control" -> null
      - is_template                 = false -> null
      - merge_commit_message        = "PR_TITLE" -> null
      - merge_commit_title          = "MERGE_MESSAGE" -> null
      - name                        = "cookiecutter-github-control" -> null
      - node_id                     = "R_kgDOI528zg" -> null
      - private                     = false -> null
      - repo_id                     = 597540046 -> null
      - squash_merge_commit_message = "COMMIT_MESSAGES" -> null
      - squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> null
      - ssh_clone_url               = "git@github.com:infrahouse/cookiecutter-github-control.git" -> null
      - svn_url                     = "https://github.com/infrahouse/cookiecutter-github-control" -> null
      - topics                      = [] -> null
      - visibility                  = "public" -> null
      - vulnerability_alerts        = false -> null

      - security_and_analysis {

          - secret_scanning {
              - status = "disabled" -> null
            }

          - secret_scanning_push_protection {
              - status = "disabled" -> null
            }
        }
    }

  # module.repos["cookiecutter-github-control"].github_team_repository.dev will be destroyed
  # (because module.repos["cookiecutter-github-control"] is not in configuration)
  - resource "github_team_repository" "dev" {
      - etag       = "W/\"8043f81b19693f6c1a72d21bb8dc03859c98bf78bfbe79782bfe13fa813992ca\"" -> null
      - id         = "7332815:cookiecutter-github-control" -> null
      - permission = "push" -> null
      - repository = "cookiecutter-github-control" -> null
      - team_id    = "7332815" -> null
    }

  # module.repos["infrahouse-toolkit"].github_repository.repo will be updated in-place
  ~ resource "github_repository" "repo" {
      ~ description                 = "InfraHouse Toolkit" -> "InfraHouse Toolkit1"
        id                          = "infrahouse-toolkit"
        name                        = "infrahouse-toolkit"
        # (31 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repos["test"].github_repository.repo will be created
  + resource "github_repository" "repo" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = false
      + description                 = "Template for a GitHub Control repository"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = true
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "test"
      + node_id                     = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + visibility                  = "public"

      + security_and_analysis {
          + advanced_security {
              + status = (known after apply)
            }

          + secret_scanning {
              + status = (known after apply)
            }

          + secret_scanning_push_protection {
              + status = (known after apply)
            }
        }
    }

  # module.repos["test"].github_team_repository.dev will be created
  + resource "github_team_repository" "dev" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "test"
      + team_id    = "7332815"
    }

Plan: 2 to add, 1 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
```
</details>
<details>
<summary>STDERR</summary>

```no output```
</details>
<details><summary><i>metadata</i></summary>
<p>
```eyJzMzovL2Zvby1idWNrZXQvcGF0aC90by9rZXkuc3RhdGUiOiB7InN1Y2Nlc3MiOiBmYWxzZSwgInN0ZG91dCI6ICJUZXJyYWZvcm0gdXNlZCB0aGUgc2VsZWN0ZWQgcHJvdmlkZXJzIHRvIGdlbmVyYXRlIHRoZSBmb2xsb3dpbmcgZXhlY3V0aW9uXG5wbGFuLiBSZXNvdXJjZSBhY3Rpb25zIGFyZSBpbmRpY2F0ZWQgd2l0aCB0aGUgZm9sbG93aW5nIHN5bWJvbHM6XG4gICsgY3JlYXRlXG4gIH4gdXBkYXRlIGluLXBsYWNlXG4gIC0gZGVzdHJveVxuXG5UZXJyYWZvcm0gd2lsbCBwZXJmb3JtIHRoZSBmb2xsb3dpbmcgYWN0aW9uczpcblxuICAjIG1vZHVsZS5yZXBvc1tcImNvb2tpZWN1dHRlci1naXRodWItY29udHJvbFwiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvIHdpbGwgYmUgZGVzdHJveWVkXG4gICMgKGJlY2F1c2UgbW9kdWxlLnJlcG9zW1wiY29va2llY3V0dGVyLWdpdGh1Yi1jb250cm9sXCJdIGlzIG5vdCBpbiBjb25maWd1cmF0aW9uKVxuICAtIHJlc291cmNlIFwiZ2l0aHViX3JlcG9zaXRvcnlcIiBcInJlcG9cIiB7XG4gICAgICAtIGFsbG93X2F1dG9fbWVyZ2UgICAgICAgICAgICA9IGZhbHNlIC0+IG51bGxcbiAgICAgIC0gYWxsb3dfbWVyZ2VfY29tbWl0ICAgICAgICAgID0gdHJ1ZSAtPiBudWxsXG4gICAgICAtIGFsbG93X3JlYmFzZV9tZXJnZSAgICAgICAgICA9IHRydWUgLT4gbnVsbFxuICAgICAgLSBhbGxvd19zcXVhc2hfbWVyZ2UgICAgICAgICAgPSB0cnVlIC0+IG51bGxcbiAgICAgIC0gYWxsb3dfdXBkYXRlX2JyYW5jaCAgICAgICAgID0gZmFsc2UgLT4gbnVsbFxuICAgICAgLSBhcmNoaXZlZCAgICAgICAgICAgICAgICAgICAgPSBmYWxzZSAtPiBudWxsXG4gICAgICAtIGRlZmF1bHRfYnJhbmNoICAgICAgICAgICAgICA9IFwibWFpblwiIC0+IG51bGxcbiAgICAgIC0gZGVsZXRlX2JyYW5jaF9vbl9tZXJnZSAgICAgID0gZmFsc2UgLT4gbnVsbFxuICAgICAgLSBkZXNjcmlwdGlvbiAgICAgICAgICAgICAgICAgPSBcIlRlbXBsYXRlIGZvciBhIEdpdEh1YiBDb250cm9sIHJlcG9zaXRvcnlcIiAtPiBudWxsXG4gICAgICAtIGV0YWcgICAgICAgICAgICAgICAgICAgICAgICA9IFwiVy9cXFwiOGI0YTc5MmJjMTQ3NGQzODFjYWFhNjNiNzY2Njg5OTNiNGFkYzQyYWU3NmVkNTNkNjg4NmQ4NTYyZWJiMGM2N1xcXCJcIiAtPiBudWxsXG4gICAgICAtIGZ1bGxfbmFtZSAgICAgICAgICAgICAgICAgICA9IFwiaW5mcmFob3VzZS9jb29raWVjdXR0ZXItZ2l0aHViLWNvbnRyb2xcIiAtPiBudWxsXG4gICAgICAtIGdpdF9jbG9uZV91cmwgICAgICAgICAgICAgICA9IFwiZ2l0Oi8vZ2l0aHViLmNvbS9pbmZyYWhvdXNlL2Nvb2tpZWN1dHRlci1naXRodWItY29udHJvbC5naXRcIiAtPiBudWxsXG4gICAgICAtIGhhc19kaXNjdXNzaW9ucyAgICAgICAgICAgICA9IGZhbHNlIC0+IG51bGxcbiAgICAgIC0gaGFzX2Rvd25sb2FkcyAgICAgICAgICAgICAgID0gZmFsc2UgLT4gbnVsbFxuICAgICAgLSBoYXNfaXNzdWVzICAgICAgICAgICAgICAgICAgPSB0cnVlIC0+IG51bGxcbiAgICAgIC0gaGFzX3Byb2plY3RzICAgICAgICAgICAgICAgID0gZmFsc2UgLT4gbnVsbFxuICAgICAgLSBoYXNfd2lraSAgICAgICAgICAgICAgICAgICAgPSBmYWxzZSAtPiBudWxsXG4gICAgICAtIGh0bWxfdXJsICAgICAgICAgICAgICAgICAgICA9IFwiaHR0cHM6Ly9naXRodWIuY29tL2luZnJhaG91c2UvY29va2llY3V0dGVyLWdpdGh1Yi1jb250cm9sXCIgLT4gbnVsbFxuICAgICAgLSBodHRwX2Nsb25lX3VybCAgICAgICAgICAgICAgPSBcImh0dHBzOi8vZ2l0aHViLmNvbS9pbmZyYWhvdXNlL2Nvb2tpZWN1dHRlci1naXRodWItY29udHJvbC5naXRcIiAtPiBudWxsXG4gICAgICAtIGlkICAgICAgICAgICAgICAgICAgICAgICAgICA9IFwiY29va2llY3V0dGVyLWdpdGh1Yi1jb250cm9sXCIgLT4gbnVsbFxuICAgICAgLSBpc190ZW1wbGF0ZSAgICAgICAgICAgICAgICAgPSBmYWxzZSAtPiBudWxsXG4gICAgICAtIG1lcmdlX2NvbW1pdF9tZXNzYWdlICAgICAgICA9IFwiUFJfVElUTEVcIiAtPiBudWxsXG4gICAgICAtIG1lcmdlX2NvbW1pdF90aXRsZSAgICAgICAgICA9IFwiTUVSR0VfTUVTU0FHRVwiIC0+IG51bGxcbiAgICAgIC0gbmFtZSAgICAgICAgICAgICAgICAgICAgICAgID0gXCJjb29raWVjdXR0ZXItZ2l0aHViLWNvbnRyb2xcIiAtPiBudWxsXG4gICAgICAtIG5vZGVfaWQgICAgICAgICAgICAgICAgICAgICA9IFwiUl9rZ0RPSTUyOHpnXCIgLT4gbnVsbFxuICAgICAgLSBwcml2YXRlICAgICAgICAgICAgICAgICAgICAgPSBmYWxzZSAtPiBudWxsXG4gICAgICAtIHJlcG9faWQgICAgICAgICAgICAgICAgICAgICA9IDU5NzU0MDA0NiAtPiBudWxsXG4gICAgICAtIHNxdWFzaF9tZXJnZV9jb21taXRfbWVzc2FnZSA9IFwiQ09NTUlUX01FU1NBR0VTXCIgLT4gbnVsbFxuICAgICAgLSBzcXVhc2hfbWVyZ2VfY29tbWl0X3RpdGxlICAgPSBcIkNPTU1JVF9PUl9QUl9USVRMRVwiIC0+IG51bGxcbiAgICAgIC0gc3NoX2Nsb25lX3VybCAgICAgICAgICAgICAgID0gXCJnaXRAZ2l0aHViLmNvbTppbmZyYWhvdXNlL2Nvb2tpZWN1dHRlci1naXRodWItY29udHJvbC5naXRcIiAtPiBudWxsXG4gICAgICAtIHN2bl91cmwgICAgICAgICAgICAgICAgICAgICA9IFwiaHR0cHM6Ly9naXRodWIuY29tL2luZnJhaG91c2UvY29va2llY3V0dGVyLWdpdGh1Yi1jb250cm9sXCIgLT4gbnVsbFxuICAgICAgLSB0b3BpY3MgICAgICAgICAgICAgICAgICAgICAgPSBbXSAtPiBudWxsXG4gICAgICAtIHZpc2liaWxpdHkgICAgICAgICAgICAgICAgICA9IFwicHVibGljXCIgLT4gbnVsbFxuICAgICAgLSB2dWxuZXJhYmlsaXR5X2FsZXJ0cyAgICAgICAgPSBmYWxzZSAtPiBudWxsXG5cbiAgICAgIC0gc2VjdXJpdHlfYW5kX2FuYWx5c2lzIHtcblxuICAgICAgICAgIC0gc2VjcmV0X3NjYW5uaW5nIHtcbiAgICAgICAgICAgICAgLSBzdGF0dXMgPSBcImRpc2FibGVkXCIgLT4gbnVsbFxuICAgICAgICAgICAgfVxuXG4gICAgICAgICAgLSBzZWNyZXRfc2Nhbm5pbmdfcHVzaF9wcm90ZWN0aW9uIHtcbiAgICAgICAgICAgICAgLSBzdGF0dXMgPSBcImRpc2FibGVkXCIgLT4gbnVsbFxuICAgICAgICAgICAgfVxuICAgICAgICB9XG4gICAgfVxuXG4gICMgbW9kdWxlLnJlcG9zW1wiY29va2llY3V0dGVyLWdpdGh1Yi1jb250cm9sXCJdLmdpdGh1Yl90ZWFtX3JlcG9zaXRvcnkuZGV2IHdpbGwgYmUgZGVzdHJveWVkXG4gICMgKGJlY2F1c2UgbW9kdWxlLnJlcG9zW1wiY29va2llY3V0dGVyLWdpdGh1Yi1jb250cm9sXCJdIGlzIG5vdCBpbiBjb25maWd1cmF0aW9uKVxuICAtIHJlc291cmNlIFwiZ2l0aHViX3RlYW1fcmVwb3NpdG9yeVwiIFwiZGV2XCIge1xuICAgICAgLSBldGFnICAgICAgID0gXCJXL1xcXCI4MDQzZjgxYjE5NjkzZjZjMWE3MmQyMWJiOGRjMDM4NTljOThiZjc4YmZiZTc5NzgyYmZlMTNmYTgxMzk5MmNhXFxcIlwiIC0+IG51bGxcbiAgICAgIC0gaWQgICAgICAgICA9IFwiNzMzMjgxNTpjb29raWVjdXR0ZXItZ2l0aHViLWNvbnRyb2xcIiAtPiBudWxsXG4gICAgICAtIHBlcm1pc3Npb24gPSBcInB1c2hcIiAtPiBudWxsXG4gICAgICAtIHJlcG9zaXRvcnkgPSBcImNvb2tpZWN1dHRlci1naXRodWItY29udHJvbFwiIC0+IG51bGxcbiAgICAgIC0gdGVhbV9pZCAgICA9IFwiNzMzMjgxNVwiIC0+IG51bGxcbiAgICB9XG5cbiAgIyBtb2R1bGUucmVwb3NbXCJpbmZyYWhvdXNlLXRvb2xraXRcIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbyB3aWxsIGJlIHVwZGF0ZWQgaW4tcGxhY2VcbiAgfiByZXNvdXJjZSBcImdpdGh1Yl9yZXBvc2l0b3J5XCIgXCJyZXBvXCIge1xuICAgICAgfiBkZXNjcmlwdGlvbiAgICAgICAgICAgICAgICAgPSBcIkluZnJhSG91c2UgVG9vbGtpdFwiIC0+IFwiSW5mcmFIb3VzZSBUb29sa2l0MVwiXG4gICAgICAgIGlkICAgICAgICAgICAgICAgICAgICAgICAgICA9IFwiaW5mcmFob3VzZS10b29sa2l0XCJcbiAgICAgICAgbmFtZSAgICAgICAgICAgICAgICAgICAgICAgID0gXCJpbmZyYWhvdXNlLXRvb2xraXRcIlxuICAgICAgICAjICgzMSB1bmNoYW5nZWQgYXR0cmlidXRlcyBoaWRkZW4pXG5cbiAgICAgICAgIyAoMSB1bmNoYW5nZWQgYmxvY2sgaGlkZGVuKVxuICAgIH1cblxuICAjIG1vZHVsZS5yZXBvc1tcInRlc3RcIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbyB3aWxsIGJlIGNyZWF0ZWRcbiAgKyByZXNvdXJjZSBcImdpdGh1Yl9yZXBvc2l0b3J5XCIgXCJyZXBvXCIge1xuICAgICAgKyBhbGxvd19hdXRvX21lcmdlICAgICAgICAgICAgPSBmYWxzZVxuICAgICAgKyBhbGxvd19tZXJnZV9jb21taXQgICAgICAgICAgPSB0cnVlXG4gICAgICArIGFsbG93X3JlYmFzZV9tZXJnZSAgICAgICAgICA9IHRydWVcbiAgICAgICsgYWxsb3dfc3F1YXNoX21lcmdlICAgICAgICAgID0gdHJ1ZVxuICAgICAgKyBhcmNoaXZlZCAgICAgICAgICAgICAgICAgICAgPSBmYWxzZVxuICAgICAgKyBkZWZhdWx0X2JyYW5jaCAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGRlbGV0ZV9icmFuY2hfb25fbWVyZ2UgICAgICA9IGZhbHNlXG4gICAgICArIGRlc2NyaXB0aW9uICAgICAgICAgICAgICAgICA9IFwiVGVtcGxhdGUgZm9yIGEgR2l0SHViIENvbnRyb2wgcmVwb3NpdG9yeVwiXG4gICAgICArIGV0YWcgICAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgZnVsbF9uYW1lICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBnaXRfY2xvbmVfdXJsICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGhhc19pc3N1ZXMgICAgICAgICAgICAgICAgICA9IHRydWVcbiAgICAgICsgaHRtbF91cmwgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBodHRwX2Nsb25lX3VybCAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGlkICAgICAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgbWVyZ2VfY29tbWl0X21lc3NhZ2UgICAgICAgID0gXCJQUl9USVRMRVwiXG4gICAgICArIG1lcmdlX2NvbW1pdF90aXRsZSAgICAgICAgICA9IFwiTUVSR0VfTUVTU0FHRVwiXG4gICAgICArIG5hbWUgICAgICAgICAgICAgICAgICAgICAgICA9IFwidGVzdFwiXG4gICAgICArIG5vZGVfaWQgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgcHJpdmF0ZSAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyByZXBvX2lkICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHNxdWFzaF9tZXJnZV9jb21taXRfbWVzc2FnZSA9IFwiQ09NTUlUX01FU1NBR0VTXCJcbiAgICAgICsgc3F1YXNoX21lcmdlX2NvbW1pdF90aXRsZSAgID0gXCJDT01NSVRfT1JfUFJfVElUTEVcIlxuICAgICAgKyBzc2hfY2xvbmVfdXJsICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHN2bl91cmwgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgdmlzaWJpbGl0eSAgICAgICAgICAgICAgICAgID0gXCJwdWJsaWNcIlxuXG4gICAgICArIHNlY3VyaXR5X2FuZF9hbmFseXNpcyB7XG4gICAgICAgICAgKyBhZHZhbmNlZF9zZWN1cml0eSB7XG4gICAgICAgICAgICAgICsgc3RhdHVzID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgICAgICAgfVxuXG4gICAgICAgICAgKyBzZWNyZXRfc2Nhbm5pbmcge1xuICAgICAgICAgICAgICArIHN0YXR1cyA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICAgICAgIH1cblxuICAgICAgICAgICsgc2VjcmV0X3NjYW5uaW5nX3B1c2hfcHJvdGVjdGlvbiB7XG4gICAgICAgICAgICAgICsgc3RhdHVzID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgICAgICAgfVxuICAgICAgICB9XG4gICAgfVxuXG4gICMgbW9kdWxlLnJlcG9zW1widGVzdFwiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldiB3aWxsIGJlIGNyZWF0ZWRcbiAgKyByZXNvdXJjZSBcImdpdGh1Yl90ZWFtX3JlcG9zaXRvcnlcIiBcImRldlwiIHtcbiAgICAgICsgZXRhZyAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgaWQgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgcGVybWlzc2lvbiA9IFwicHVzaFwiXG4gICAgICArIHJlcG9zaXRvcnkgPSBcInRlc3RcIlxuICAgICAgKyB0ZWFtX2lkICAgID0gXCI3MzMyODE1XCJcbiAgICB9XG5cblBsYW46IDIgdG8gYWRkLCAxIHRvIGNoYW5nZSwgMiB0byBkZXN0cm95LlxuXG5cdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcblxuU2F2ZWQgdGhlIHBsYW4gdG86IHRmLnBsYW5cblxuVG8gcGVyZm9ybSBleGFjdGx5IHRoZXNlIGFjdGlvbnMsIHJ1biB0aGUgZm9sbG93aW5nIGNvbW1hbmQgdG8gYXBwbHk6XG4gICAgdGVycmFmb3JtIGFwcGx5IFwidGYucGxhblwiIiwgInN0ZGVyciI6IG51bGwsICJhZGQiOiAyLCAiY2hhbmdlIjogMSwgImRlc3Ryb3kiOiAyfX0=```
</p></details>
PASSED
infrahouse_toolkit/terraform/tests/github_pr/test_publish_comment.py::test_publish_comment 
# State **`s3://foo-bucket/path/to/key.state`**
## Affected resources counts

|  Success  |   🟢 Add |   🟡 Change |   🔴 Destroy |
|:---------:|--------:|-----------:|------------:|
|     ✅     |       2 |          1 |           2 |
## Affected resources by action

|  Action  | Resources                                                                |
|:--------:|:-------------------------------------------------------------------------|
|    🟢     | `module.repos["test"].github_repository.repo`                            |
|    🟢     | `module.repos["test"].github_team_repository.dev`                        |
|    🟡     | `module.repos["infrahouse-toolkit"].github_repository.repo`              |
|    🔴     | `module.repos["cookiecutter-github-control"].github_repository.repo`     |
|    🔴     | `module.repos["cookiecutter-github-control"].github_team_repository.dev` |
<details>
<summary>STDOUT</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.repos["cookiecutter-github-control"].github_repository.repo will be destroyed
  # (because module.repos["cookiecutter-github-control"] is not in configuration)
  - resource "github_repository" "repo" {
      - allow_auto_merge            = false -> null
      - allow_merge_commit          = true -> null
      - allow_rebase_merge          = true -> null
      - allow_squash_merge          = true -> null
      - allow_update_branch         = false -> null
      - archived                    = false -> null
      - default_branch              = "main" -> null
      - delete_branch_on_merge      = false -> null
      - description                 = "Template for a GitHub Control repository" -> null
      - etag                        = "W/\"8b4a792bc1474d381caaa63b76668993b4adc42ae76ed53d6886d8562ebb0c67\"" -> null
      - full_name                   = "infrahouse/cookiecutter-github-control" -> null
      - git_clone_url               = "git://github.com/infrahouse/cookiecutter-github-control.git" -> null
      - has_discussions             = false -> null
      - has_downloads               = false -> null
      - has_issues                  = true -> null
      - has_projects                = false -> null
      - has_wiki                    = false -> null
      - html_url                    = "https://github.com/infrahouse/cookiecutter-github-control" -> null
      - http_clone_url              = "https://github.com/infrahouse/cookiecutter-github-control.git" -> null
      - id                          = "cookiecutter-github-control" -> null
      - is_template                 = false -> null
      - merge_commit_message        = "PR_TITLE" -> null
      - merge_commit_title          = "MERGE_MESSAGE" -> null
      - name                        = "cookiecutter-github-control" -> null
      - node_id                     = "R_kgDOI528zg" -> null
      - private                     = false -> null
      - repo_id                     = 597540046 -> null
      - squash_merge_commit_message = "COMMIT_MESSAGES" -> null
      - squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> null
      - ssh_clone_url               = "git@github.com:infrahouse/cookiecutter-github-control.git" -> null
      - svn_url                     = "https://github.com/infrahouse/cookiecutter-github-control" -> null
      - topics                      = [] -> null
      - visibility                  = "public" -> null
      - vulnerability_alerts        = false -> null

      - security_and_analysis {

          - secret_scanning {
              - status = "disabled" -> null
            }

          - secret_scanning_push_protection {
              - status = "disabled" -> null
            }
        }
    }

  # module.repos["cookiecutter-github-control"].github_team_repository.dev will be destroyed
  # (because module.repos["cookiecutter-github-control"] is not in configuration)
  - resource "github_team_repository" "dev" {
      - etag       = "W/\"8043f81b19693f6c1a72d21bb8dc03859c98bf78bfbe79782bfe13fa813992ca\"" -> null
      - id         = "7332815:cookiecutter-github-control" -> null
      - permission = "push" -> null
      - repository = "cookiecutter-github-control" -> null
      - team_id    = "7332815" -> null
    }

  # module.repos["infrahouse-toolkit"].github_repository.repo will be updated in-place
  ~ resource "github_repository" "repo" {
      ~ description                 = "InfraHouse Toolkit" -> "InfraHouse Toolkit1"
        id                          = "infrahouse-toolkit"
        name                        = "infrahouse-toolkit"
        # (31 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repos["test"].github_repository.repo will be created
  + resource "github_repository" "repo" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = false
      + description                 = "Template for a GitHub Control repository"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = true
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "test"
      + node_id                     = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + visibility                  = "public"

      + security_and_analysis {
          + advanced_security {
              + status = (known after apply)
            }

          + secret_scanning {
              + status = (known after apply)
            }

          + secret_scanning_push_protection {
              + status = (known after apply)
            }
        }
    }

  # module.repos["test"].github_team_repository.dev will be created
  + resource "github_team_repository" "dev" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "test"
      + team_id    = "7332815"
    }

Plan: 2 to add, 1 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
```
</details>
<details>
<summary>STDERR</summary>

```no output```
</details>
<details><summary><i>metadata</i></summary>
<p>
```eyJzMzovL2Zvby1idWNrZXQvcGF0aC90by9rZXkuc3RhdGUiOiB7InN1Y2Nlc3MiOiB0cnVlLCAic3Rkb3V0IjogIlRlcnJhZm9ybSB1c2VkIHRoZSBzZWxlY3RlZCBwcm92aWRlcnMgdG8gZ2VuZXJhdGUgdGhlIGZvbGxvd2luZyBleGVjdXRpb25cbnBsYW4uIFJlc291cmNlIGFjdGlvbnMgYXJlIGluZGljYXRlZCB3aXRoIHRoZSBmb2xsb3dpbmcgc3ltYm9sczpcbiAgKyBjcmVhdGVcbiAgfiB1cGRhdGUgaW4tcGxhY2VcbiAgLSBkZXN0cm95XG5cblRlcnJhZm9ybSB3aWxsIHBlcmZvcm0gdGhlIGZvbGxvd2luZyBhY3Rpb25zOlxuXG4gICMgbW9kdWxlLnJlcG9zW1wiY29va2llY3V0dGVyLWdpdGh1Yi1jb250cm9sXCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG8gd2lsbCBiZSBkZXN0cm95ZWRcbiAgIyAoYmVjYXVzZSBtb2R1bGUucmVwb3NbXCJjb29raWVjdXR0ZXItZ2l0aHViLWNvbnRyb2xcIl0gaXMgbm90IGluIGNvbmZpZ3VyYXRpb24pXG4gIC0gcmVzb3VyY2UgXCJnaXRodWJfcmVwb3NpdG9yeVwiIFwicmVwb1wiIHtcbiAgICAgIC0gYWxsb3dfYXV0b19tZXJnZSAgICAgICAgICAgID0gZmFsc2UgLT4gbnVsbFxuICAgICAgLSBhbGxvd19tZXJnZV9jb21taXQgICAgICAgICAgPSB0cnVlIC0+IG51bGxcbiAgICAgIC0gYWxsb3dfcmViYXNlX21lcmdlICAgICAgICAgID0gdHJ1ZSAtPiBudWxsXG4gICAgICAtIGFsbG93X3NxdWFzaF9tZXJnZSAgICAgICAgICA9IHRydWUgLT4gbnVsbFxuICAgICAgLSBhbGxvd191cGRhdGVfYnJhbmNoICAgICAgICAgPSBmYWxzZSAtPiBudWxsXG4gICAgICAtIGFyY2hpdmVkICAgICAgICAgICAgICAgICAgICA9IGZhbHNlIC0+IG51bGxcbiAgICAgIC0gZGVmYXVsdF9icmFuY2ggICAgICAgICAgICAgID0gXCJtYWluXCIgLT4gbnVsbFxuICAgICAgLSBkZWxldGVfYnJhbmNoX29uX21lcmdlICAgICAgPSBmYWxzZSAtPiBudWxsXG4gICAgICAtIGRlc2NyaXB0aW9uICAgICAgICAgICAgICAgICA9IFwiVGVtcGxhdGUgZm9yIGEgR2l0SHViIENvbnRyb2wgcmVwb3NpdG9yeVwiIC0+IG51bGxcbiAgICAgIC0gZXRhZyAgICAgICAgICAgICAgICAgICAgICAgID0gXCJXL1xcXCI4YjRhNzkyYmMxNDc0ZDM4MWNhYWE2M2I3NjY2ODk5M2I0YWRjNDJhZTc2ZWQ1M2Q2ODg2ZDg1NjJlYmIwYzY3XFxcIlwiIC0+IG51bGxcbiAgICAgIC0gZnVsbF9uYW1lICAgICAgICAgICAgICAgICAgID0gXCJpbmZyYWhvdXNlL2Nvb2tpZWN1dHRlci1naXRodWItY29udHJvbFwiIC0+IG51bGxcbiAgICAgIC0gZ2l0X2Nsb25lX3VybCAgICAgICAgICAgICAgID0gXCJnaXQ6Ly9naXRodWIuY29tL2luZnJhaG91c2UvY29va2llY3V0dGVyLWdpdGh1Yi1jb250cm9sLmdpdFwiIC0+IG51bGxcbiAgICAgIC0gaGFzX2Rpc2N1c3Npb25zICAgICAgICAgICAgID0gZmFsc2UgLT4gbnVsbFxuICAgICAgLSBoYXNfZG93bmxvYWRzICAgICAgICAgICAgICAgPSBmYWxzZSAtPiBudWxsXG4gICAgICAtIGhhc19pc3N1ZXMgICAgICAgICAgICAgICAgICA9IHRydWUgLT4gbnVsbFxuICAgICAgLSBoYXNfcHJvamVjdHMgICAgICAgICAgICAgICAgPSBmYWxzZSAtPiBudWxsXG4gICAgICAtIGhhc193aWtpICAgICAgICAgICAgICAgICAgICA9IGZhbHNlIC0+IG51bGxcbiAgICAgIC0gaHRtbF91cmwgICAgICAgICAgICAgICAgICAgID0gXCJodHRwczovL2dpdGh1Yi5jb20vaW5mcmFob3VzZS9jb29raWVjdXR0ZXItZ2l0aHViLWNvbnRyb2xcIiAtPiBudWxsXG4gICAgICAtIGh0dHBfY2xvbmVfdXJsICAgICAgICAgICAgICA9IFwiaHR0cHM6Ly9naXRodWIuY29tL2luZnJhaG91c2UvY29va2llY3V0dGVyLWdpdGh1Yi1jb250cm9sLmdpdFwiIC0+IG51bGxcbiAgICAgIC0gaWQgICAgICAgICAgICAgICAgICAgICAgICAgID0gXCJjb29raWVjdXR0ZXItZ2l0aHViLWNvbnRyb2xcIiAtPiBudWxsXG4gICAgICAtIGlzX3RlbXBsYXRlICAgICAgICAgICAgICAgICA9IGZhbHNlIC0+IG51bGxcbiAgICAgIC0gbWVyZ2VfY29tbWl0X21lc3NhZ2UgICAgICAgID0gXCJQUl9USVRMRVwiIC0+IG51bGxcbiAgICAgIC0gbWVyZ2VfY29tbWl0X3RpdGxlICAgICAgICAgID0gXCJNRVJHRV9NRVNTQUdFXCIgLT4gbnVsbFxuICAgICAgLSBuYW1lICAgICAgICAgICAgICAgICAgICAgICAgPSBcImNvb2tpZWN1dHRlci1naXRodWItY29udHJvbFwiIC0+IG51bGxcbiAgICAgIC0gbm9kZV9pZCAgICAgICAgICAgICAgICAgICAgID0gXCJSX2tnRE9JNTI4emdcIiAtPiBudWxsXG4gICAgICAtIHByaXZhdGUgICAgICAgICAgICAgICAgICAgICA9IGZhbHNlIC0+IG51bGxcbiAgICAgIC0gcmVwb19pZCAgICAgICAgICAgICAgICAgICAgID0gNTk3NTQwMDQ2IC0+IG51bGxcbiAgICAgIC0gc3F1YXNoX21lcmdlX2NvbW1pdF9tZXNzYWdlID0gXCJDT01NSVRfTUVTU0FHRVNcIiAtPiBudWxsXG4gICAgICAtIHNxdWFzaF9tZXJnZV9jb21taXRfdGl0bGUgICA9IFwiQ09NTUlUX09SX1BSX1RJVExFXCIgLT4gbnVsbFxuICAgICAgLSBzc2hfY2xvbmVfdXJsICAgICAgICAgICAgICAgPSBcImdpdEBnaXRodWIuY29tOmluZnJhaG91c2UvY29va2llY3V0dGVyLWdpdGh1Yi1jb250cm9sLmdpdFwiIC0+IG51bGxcbiAgICAgIC0gc3ZuX3VybCAgICAgICAgICAgICAgICAgICAgID0gXCJodHRwczovL2dpdGh1Yi5jb20vaW5mcmFob3VzZS9jb29raWVjdXR0ZXItZ2l0aHViLWNvbnRyb2xcIiAtPiBudWxsXG4gICAgICAtIHRvcGljcyAgICAgICAgICAgICAgICAgICAgICA9IFtdIC0+IG51bGxcbiAgICAgIC0gdmlzaWJpbGl0eSAgICAgICAgICAgICAgICAgID0gXCJwdWJsaWNcIiAtPiBudWxsXG4gICAgICAtIHZ1bG5lcmFiaWxpdHlfYWxlcnRzICAgICAgICA9IGZhbHNlIC0+IG51bGxcblxuICAgICAgLSBzZWN1cml0eV9hbmRfYW5hbHlzaXMge1xuXG4gICAgICAgICAgLSBzZWNyZXRfc2Nhbm5pbmcge1xuICAgICAgICAgICAgICAtIHN0YXR1cyA9IFwiZGlzYWJsZWRcIiAtPiBudWxsXG4gICAgICAgICAgICB9XG5cbiAgICAgICAgICAtIHNlY3JldF9zY2FubmluZ19wdXNoX3Byb3RlY3Rpb24ge1xuICAgICAgICAgICAgICAtIHN0YXR1cyA9IFwiZGlzYWJsZWRcIiAtPiBudWxsXG4gICAgICAgICAgICB9XG4gICAgICAgIH1cbiAgICB9XG5cbiAgIyBtb2R1bGUucmVwb3NbXCJjb29raWVjdXR0ZXItZ2l0aHViLWNvbnRyb2xcIl0uZ2l0aHViX3RlYW1fcmVwb3NpdG9yeS5kZXYgd2lsbCBiZSBkZXN0cm95ZWRcbiAgIyAoYmVjYXVzZSBtb2R1bGUucmVwb3NbXCJjb29raWVjdXR0ZXItZ2l0aHViLWNvbnRyb2xcIl0gaXMgbm90IGluIGNvbmZpZ3VyYXRpb24pXG4gIC0gcmVzb3VyY2UgXCJnaXRodWJfdGVhbV9yZXBvc2l0b3J5XCIgXCJkZXZcIiB7XG4gICAgICAtIGV0YWcgICAgICAgPSBcIlcvXFxcIjgwNDNmODFiMTk2OTNmNmMxYTcyZDIxYmI4ZGMwMzg1OWM5OGJmNzhiZmJlNzk3ODJiZmUxM2ZhODEzOTkyY2FcXFwiXCIgLT4gbnVsbFxuICAgICAgLSBpZCAgICAgICAgID0gXCI3MzMyODE1OmNvb2tpZWN1dHRlci1naXRodWItY29udHJvbFwiIC0+IG51bGxcbiAgICAgIC0gcGVybWlzc2lvbiA9IFwicHVzaFwiIC0+IG51bGxcbiAgICAgIC0gcmVwb3NpdG9yeSA9IFwiY29va2llY3V0dGVyLWdpdGh1Yi1jb250cm9sXCIgLT4gbnVsbFxuICAgICAgLSB0ZWFtX2lkICAgID0gXCI3MzMyODE1XCIgLT4gbnVsbFxuICAgIH1cblxuICAjIG1vZHVsZS5yZXBvc1tcImluZnJhaG91c2UtdG9vbGtpdFwiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvIHdpbGwgYmUgdXBkYXRlZCBpbi1wbGFjZVxuICB+IHJlc291cmNlIFwiZ2l0aHViX3JlcG9zaXRvcnlcIiBcInJlcG9cIiB7XG4gICAgICB+IGRlc2NyaXB0aW9uICAgICAgICAgICAgICAgICA9IFwiSW5mcmFIb3VzZSBUb29sa2l0XCIgLT4gXCJJbmZyYUhvdXNlIFRvb2xraXQxXCJcbiAgICAgICAgaWQgICAgICAgICAgICAgICAgICAgICAgICAgID0gXCJpbmZyYWhvdXNlLXRvb2xraXRcIlxuICAgICAgICBuYW1lICAgICAgICAgICAgICAgICAgICAgICAgPSBcImluZnJhaG91c2UtdG9vbGtpdFwiXG4gICAgICAgICMgKDMxIHVuY2hhbmdlZCBhdHRyaWJ1dGVzIGhpZGRlbilcblxuICAgICAgICAjICgxIHVuY2hhbmdlZCBibG9jayBoaWRkZW4pXG4gICAgfVxuXG4gICMgbW9kdWxlLnJlcG9zW1widGVzdFwiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvIHdpbGwgYmUgY3JlYXRlZFxuICArIHJlc291cmNlIFwiZ2l0aHViX3JlcG9zaXRvcnlcIiBcInJlcG9cIiB7XG4gICAgICArIGFsbG93X2F1dG9fbWVyZ2UgICAgICAgICAgICA9IGZhbHNlXG4gICAgICArIGFsbG93X21lcmdlX2NvbW1pdCAgICAgICAgICA9IHRydWVcbiAgICAgICsgYWxsb3dfcmViYXNlX21lcmdlICAgICAgICAgID0gdHJ1ZVxuICAgICAgKyBhbGxvd19zcXVhc2hfbWVyZ2UgICAgICAgICAgPSB0cnVlXG4gICAgICArIGFyY2hpdmVkICAgICAgICAgICAgICAgICAgICA9IGZhbHNlXG4gICAgICArIGRlZmF1bHRfYnJhbmNoICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgZGVsZXRlX2JyYW5jaF9vbl9tZXJnZSAgICAgID0gZmFsc2VcbiAgICAgICsgZGVzY3JpcHRpb24gICAgICAgICAgICAgICAgID0gXCJUZW1wbGF0ZSBmb3IgYSBHaXRIdWIgQ29udHJvbCByZXBvc2l0b3J5XCJcbiAgICAgICsgZXRhZyAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBmdWxsX25hbWUgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGdpdF9jbG9uZV91cmwgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgaGFzX2lzc3VlcyAgICAgICAgICAgICAgICAgID0gdHJ1ZVxuICAgICAgKyBodG1sX3VybCAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGh0dHBfY2xvbmVfdXJsICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgaWQgICAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBtZXJnZV9jb21taXRfbWVzc2FnZSAgICAgICAgPSBcIlBSX1RJVExFXCJcbiAgICAgICsgbWVyZ2VfY29tbWl0X3RpdGxlICAgICAgICAgID0gXCJNRVJHRV9NRVNTQUdFXCJcbiAgICAgICsgbmFtZSAgICAgICAgICAgICAgICAgICAgICAgID0gXCJ0ZXN0XCJcbiAgICAgICsgbm9kZV9pZCAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBwcml2YXRlICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHJlcG9faWQgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgc3F1YXNoX21lcmdlX2NvbW1pdF9tZXNzYWdlID0gXCJDT01NSVRfTUVTU0FHRVNcIlxuICAgICAgKyBzcXVhc2hfbWVyZ2VfY29tbWl0X3RpdGxlICAgPSBcIkNPTU1JVF9PUl9QUl9USVRMRVwiXG4gICAgICArIHNzaF9jbG9uZV91cmwgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgc3ZuX3VybCAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyB2aXNpYmlsaXR5ICAgICAgICAgICAgICAgICAgPSBcInB1YmxpY1wiXG5cbiAgICAgICsgc2VjdXJpdHlfYW5kX2FuYWx5c2lzIHtcbiAgICAgICAgICArIGFkdmFuY2VkX3NlY3VyaXR5IHtcbiAgICAgICAgICAgICAgKyBzdGF0dXMgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICAgICAgICB9XG5cbiAgICAgICAgICArIHNlY3JldF9zY2FubmluZyB7XG4gICAgICAgICAgICAgICsgc3RhdHVzID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgICAgICAgfVxuXG4gICAgICAgICAgKyBzZWNyZXRfc2Nhbm5pbmdfcHVzaF9wcm90ZWN0aW9uIHtcbiAgICAgICAgICAgICAgKyBzdGF0dXMgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICAgICAgICB9XG4gICAgICAgIH1cbiAgICB9XG5cbiAgIyBtb2R1bGUucmVwb3NbXCJ0ZXN0XCJdLmdpdGh1Yl90ZWFtX3JlcG9zaXRvcnkuZGV2IHdpbGwgYmUgY3JlYXRlZFxuICArIHJlc291cmNlIFwiZ2l0aHViX3RlYW1fcmVwb3NpdG9yeVwiIFwiZGV2XCIge1xuICAgICAgKyBldGFnICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBpZCAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBwZXJtaXNzaW9uID0gXCJwdXNoXCJcbiAgICAgICsgcmVwb3NpdG9yeSA9IFwidGVzdFwiXG4gICAgICArIHRlYW1faWQgICAgPSBcIjczMzI4MTVcIlxuICAgIH1cblxuUGxhbjogMiB0byBhZGQsIDEgdG8gY2hhbmdlLCAyIHRvIGRlc3Ryb3kuXG5cblx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFxuXG5TYXZlZCB0aGUgcGxhbiB0bzogdGYucGxhblxuXG5UbyBwZXJmb3JtIGV4YWN0bHkgdGhlc2UgYWN0aW9ucywgcnVuIHRoZSBmb2xsb3dpbmcgY29tbWFuZCB0byBhcHBseTpcbiAgICB0ZXJyYWZvcm0gYXBwbHkgXCJ0Zi5wbGFuXCIiLCAic3RkZXJyIjogbnVsbCwgImFkZCI6IDIsICJjaGFuZ2UiOiAxLCAiZGVzdHJveSI6IDJ9fQ==```
</p></details>
PASSED
infrahouse_toolkit/terraform/tests/github_pr/test_publish_comment.py::test_publish_too_large_comment PASSED
infrahouse_toolkit/terraform/tests/github_pr/test_publish_gist.py::test_publish_gist https://gist.github.com/akuzminsky/d996658ea293faeda527acd99a8269d3
PASSED
infrahouse_toolkit/terraform/tests/status/test_comment.py::test_comment[plan-no-output.stdout-result_counts0-\n# State **`s3://foo_backet/path/to/tf.state`**\n## Affected resources counts\n\n|  Success  |   \U0001f7e2 Add |   \U0001f7e1 Change |   \U0001f534 Destroy |\n|:---------:|--------:|-----------:|------------:|\n|     \u2705     |       1 |          1 |           1 |\n<details>\n<summary>STDOUT</summary>\n\n```\nno stdout\n```\n</details>\n<details>\n<summary>STDERR</summary>\n\n```no output```\n</details>\n<details><summary><i>metadata</i></summary>\n<p>\n```eyJzMzovL2Zvb19iYWNrZXQvcGF0aC90by90Zi5zdGF0ZSI6IHsic3VjY2VzcyI6IHRydWUsICJzdGRvdXQiOiAibm8gc3Rkb3V0IiwgInN0ZGVyciI6IG51bGwsICJhZGQiOiAxLCAiY2hhbmdlIjogMSwgImRlc3Ryb3kiOiAxfX0=```\n</p></details>] PASSED
infrahouse_toolkit/terraform/tests/status/test_comment.py::test_comment[plan-0-0-0.stdout-result_counts1-\n# State **`s3://foo_backet/path/to/tf.state`**\n## Affected resources counts\n\n|  Success  |    Add |    Change |    Destroy |\n|:---------:|-------:|----------:|-----------:|\n|     \u2705     |      0 |         0 |          0 |\n<details>\n<summary>STDOUT</summary>\n\n```\nTerraform has compared your real infrastructure against your configuration\nand found no differences, so no changes are needed.\n```\n</details>\n<details>\n<summary>STDERR</summary>\n\n```no output```\n</details>\n<details><summary><i>metadata</i></summary>\n<p>\n```eyJzMzovL2Zvb19iYWNrZXQvcGF0aC90by90Zi5zdGF0ZSI6IHsic3VjY2VzcyI6IHRydWUsICJzdGRvdXQiOiAiVGVycmFmb3JtIGhhcyBjb21wYXJlZCB5b3VyIHJlYWwgaW5mcmFzdHJ1Y3R1cmUgYWdhaW5zdCB5b3VyIGNvbmZpZ3VyYXRpb25cbmFuZCBmb3VuZCBubyBkaWZmZXJlbmNlcywgc28gbm8gY2hhbmdlcyBhcmUgbmVlZGVkLiIsICJzdGRlcnIiOiBudWxsLCAiYWRkIjogMCwgImNoYW5nZSI6IDAsICJkZXN0cm95IjogMH19```\n</p></details>] PASSED
infrahouse_toolkit/terraform/tests/status/test_comment.py::test_comment[plan-2-0-0.stdout-result_counts2-\n# State **`s3://foo_backet/path/to/tf.state`**\n## Affected resources counts\n\n|  Success  |   \U0001f7e2 Add |    Change |    Destroy |\n|:---------:|--------:|----------:|-----------:|\n|     \u2705     |       2 |         0 |          0 |\n<details>\n<summary>STDOUT</summary>\n\n```\nTerraform used the selected providers to generate the following execution\nplan. Resource actions are indicated with the following symbols:\n  + create\n\nTerraform will perform the following actions:\n\n  # module.repos["test"].github_repository.repo will be created\n  + resource "github_repository" "repo" {\n      + allow_auto_merge            = false\n      + allow_merge_commit          = true\n      + allow_rebase_merge          = true\n      + allow_squash_merge          = true\n      + archived                    = false\n      + default_branch              = (known after apply)\n      + delete_branch_on_merge      = false\n      + description                 = "Template for a GitHub Control repository"\n      + etag                        = (known after apply)\n      + full_name                   = (known after apply)\n      + git_clone_url               = (known after apply)\n      + has_issues                  = true\n      + html_url                    = (known after apply)\n      + http_clone_url              = (known after apply)\n      + id                          = (known after apply)\n      + merge_commit_message        = "PR_TITLE"\n      + merge_commit_title          = "MERGE_MESSAGE"\n      + name                        = "test"\n      + node_id                     = (known after apply)\n      + private                     = (known after apply)\n      + repo_id                     = (known after apply)\n      + squash_merge_commit_message = "COMMIT_MESSAGES"\n      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"\n      + ssh_clone_url               = (known after apply)\n      + svn_url                     = (known after apply)\n      + visibility                  = "public"\n\n      + security_and_analysis {\n          + advanced_security {\n              + status = (known after apply)\n            }\n\n          + secret_scanning {\n              + status = (known after apply)\n            }\n\n          + secret_scanning_push_protection {\n              + status = (known after apply)\n            }\n        }\n    }\n\n  # module.repos["test"].github_team_repository.dev will be created\n  + resource "github_team_repository" "dev" {\n      + etag       = (known after apply)\n      + id         = (known after apply)\n      + permission = "push"\n      + repository = "test"\n      + team_id    = "7332815"\n    }\n\nPlan: 2 to add, 0 to change, 0 to destroy.\n\n\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\n\nSaved the plan to: tf.plan\n\nTo perform exactly these actions, run the following command to apply:\n    terraform apply "tf.plan"\n```\n</details>\n<details>\n<summary>STDERR</summary>\n\n```no output```\n</details>\n<details><summary><i>metadata</i></summary>\n<p>\n```eyJzMzovL2Zvb19iYWNrZXQvcGF0aC90by90Zi5zdGF0ZSI6IHsic3VjY2VzcyI6IHRydWUsICJzdGRvdXQiOiAiVGVycmFmb3JtIHVzZWQgdGhlIHNlbGVjdGVkIHByb3ZpZGVycyB0byBnZW5lcmF0ZSB0aGUgZm9sbG93aW5nIGV4ZWN1dGlvblxucGxhbi4gUmVzb3VyY2UgYWN0aW9ucyBhcmUgaW5kaWNhdGVkIHdpdGggdGhlIGZvbGxvd2luZyBzeW1ib2xzOlxuICArIGNyZWF0ZVxuXG5UZXJyYWZvcm0gd2lsbCBwZXJmb3JtIHRoZSBmb2xsb3dpbmcgYWN0aW9uczpcblxuICAjIG1vZHVsZS5yZXBvc1tcInRlc3RcIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbyB3aWxsIGJlIGNyZWF0ZWRcbiAgKyByZXNvdXJjZSBcImdpdGh1Yl9yZXBvc2l0b3J5XCIgXCJyZXBvXCIge1xuICAgICAgKyBhbGxvd19hdXRvX21lcmdlICAgICAgICAgICAgPSBmYWxzZVxuICAgICAgKyBhbGxvd19tZXJnZV9jb21taXQgICAgICAgICAgPSB0cnVlXG4gICAgICArIGFsbG93X3JlYmFzZV9tZXJnZSAgICAgICAgICA9IHRydWVcbiAgICAgICsgYWxsb3dfc3F1YXNoX21lcmdlICAgICAgICAgID0gdHJ1ZVxuICAgICAgKyBhcmNoaXZlZCAgICAgICAgICAgICAgICAgICAgPSBmYWxzZVxuICAgICAgKyBkZWZhdWx0X2JyYW5jaCAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGRlbGV0ZV9icmFuY2hfb25fbWVyZ2UgICAgICA9IGZhbHNlXG4gICAgICArIGRlc2NyaXB0aW9uICAgICAgICAgICAgICAgICA9IFwiVGVtcGxhdGUgZm9yIGEgR2l0SHViIENvbnRyb2wgcmVwb3NpdG9yeVwiXG4gICAgICArIGV0YWcgICAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgZnVsbF9uYW1lICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBnaXRfY2xvbmVfdXJsICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGhhc19pc3N1ZXMgICAgICAgICAgICAgICAgICA9IHRydWVcbiAgICAgICsgaHRtbF91cmwgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBodHRwX2Nsb25lX3VybCAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGlkICAgICAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgbWVyZ2VfY29tbWl0X21lc3NhZ2UgICAgICAgID0gXCJQUl9USVRMRVwiXG4gICAgICArIG1lcmdlX2NvbW1pdF90aXRsZSAgICAgICAgICA9IFwiTUVSR0VfTUVTU0FHRVwiXG4gICAgICArIG5hbWUgICAgICAgICAgICAgICAgICAgICAgICA9IFwidGVzdFwiXG4gICAgICArIG5vZGVfaWQgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgcHJpdmF0ZSAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyByZXBvX2lkICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHNxdWFzaF9tZXJnZV9jb21taXRfbWVzc2FnZSA9IFwiQ09NTUlUX01FU1NBR0VTXCJcbiAgICAgICsgc3F1YXNoX21lcmdlX2NvbW1pdF90aXRsZSAgID0gXCJDT01NSVRfT1JfUFJfVElUTEVcIlxuICAgICAgKyBzc2hfY2xvbmVfdXJsICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHN2bl91cmwgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgdmlzaWJpbGl0eSAgICAgICAgICAgICAgICAgID0gXCJwdWJsaWNcIlxuXG4gICAgICArIHNlY3VyaXR5X2FuZF9hbmFseXNpcyB7XG4gICAgICAgICAgKyBhZHZhbmNlZF9zZWN1cml0eSB7XG4gICAgICAgICAgICAgICsgc3RhdHVzID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgICAgICAgfVxuXG4gICAgICAgICAgKyBzZWNyZXRfc2Nhbm5pbmcge1xuICAgICAgICAgICAgICArIHN0YXR1cyA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICAgICAgIH1cblxuICAgICAgICAgICsgc2VjcmV0X3NjYW5uaW5nX3B1c2hfcHJvdGVjdGlvbiB7XG4gICAgICAgICAgICAgICsgc3RhdHVzID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgICAgICAgfVxuICAgICAgICB9XG4gICAgfVxuXG4gICMgbW9kdWxlLnJlcG9zW1widGVzdFwiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldiB3aWxsIGJlIGNyZWF0ZWRcbiAgKyByZXNvdXJjZSBcImdpdGh1Yl90ZWFtX3JlcG9zaXRvcnlcIiBcImRldlwiIHtcbiAgICAgICsgZXRhZyAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgaWQgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgcGVybWlzc2lvbiA9IFwicHVzaFwiXG4gICAgICArIHJlcG9zaXRvcnkgPSBcInRlc3RcIlxuICAgICAgKyB0ZWFtX2lkICAgID0gXCI3MzMyODE1XCJcbiAgICB9XG5cblBsYW46IDIgdG8gYWRkLCAwIHRvIGNoYW5nZSwgMCB0byBkZXN0cm95LlxuXG5cdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcblxuU2F2ZWQgdGhlIHBsYW4gdG86IHRmLnBsYW5cblxuVG8gcGVyZm9ybSBleGFjdGx5IHRoZXNlIGFjdGlvbnMsIHJ1biB0aGUgZm9sbG93aW5nIGNvbW1hbmQgdG8gYXBwbHk6XG4gICAgdGVycmFmb3JtIGFwcGx5IFwidGYucGxhblwiIiwgInN0ZGVyciI6IG51bGwsICJhZGQiOiAyLCAiY2hhbmdlIjogMCwgImRlc3Ryb3kiOiAwfX0=```\n</p></details>] PASSED
infrahouse_toolkit/terraform/tests/status/test_comment.py::test_comment[plan-2-1-2.stdout-result_counts3-\n# State **`s3://foo_backet/path/to/tf.state`**\n## Affected resources counts\n\n|  Success  |   \U0001f7e2 Add |   \U0001f7e1 Change |   \U0001f534 Destroy |\n|:---------:|--------:|-----------:|------------:|\n|     \u2705     |       2 |          1 |           2 |\n<details>\n<summary>STDOUT</summary>\n\n```\nTerraform used the selected providers to generate the following execution\nplan. Resource actions are indicated with the following symbols:\n  + create\n  ~ update in-place\n  - destroy\n\nTerraform will perform the following actions:\n\n  # module.repos["cookiecutter-github-control"].github_repository.repo will be destroyed\n  # (because module.repos["cookiecutter-github-control"] is not in configuration)\n  - resource "github_repository" "repo" {\n      - allow_auto_merge            = false -> null\n      - allow_merge_commit          = true -> null\n      - allow_rebase_merge          = true -> null\n      - allow_squash_merge          = true -> null\n      - allow_update_branch         = false -> null\n      - archived                    = false -> null\n      - default_branch              = "main" -> null\n      - delete_branch_on_merge      = false -> null\n      - description                 = "Template for a GitHub Control repository" -> null\n      - etag                        = "W/\\"8b4a792bc1474d381caaa63b76668993b4adc42ae76ed53d6886d8562ebb0c67\\"" -> null\n      - full_name                   = "infrahouse/cookiecutter-github-control" -> null\n      - git_clone_url               = "git://github.com/infrahouse/cookiecutter-github-control.git" -> null\n      - has_discussions             = false -> null\n      - has_downloads               = false -> null\n      - has_issues                  = true -> null\n      - has_projects                = false -> null\n      - has_wiki                    = false -> null\n      - html_url                    = "https://github.com/infrahouse/cookiecutter-github-control" -> null\n      - http_clone_url              = "https://github.com/infrahouse/cookiecutter-github-control.git" -> null\n      - id                          = "cookiecutter-github-control" -> null\n      - is_template                 = false -> null\n      - merge_commit_message        = "PR_TITLE" -> null\n      - merge_commit_title          = "MERGE_MESSAGE" -> null\n      - name                        = "cookiecutter-github-control" -> null\n      - node_id                     = "R_kgDOI528zg" -> null\n      - private                     = false -> null\n      - repo_id                     = 597540046 -> null\n      - squash_merge_commit_message = "COMMIT_MESSAGES" -> null\n      - squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> null\n      - ssh_clone_url               = "git@github.com:infrahouse/cookiecutter-github-control.git" -> null\n      - svn_url                     = "https://github.com/infrahouse/cookiecutter-github-control" -> null\n      - topics                      = [] -> null\n      - visibility                  = "public" -> null\n      - vulnerability_alerts        = false -> null\n\n      - security_and_analysis {\n\n          - secret_scanning {\n              - status = "disabled" -> null\n            }\n\n          - secret_scanning_push_protection {\n              - status = "disabled" -> null\n            }\n        }\n    }\n\n  # module.repos["cookiecutter-github-control"].github_team_repository.dev will be destroyed\n  # (because module.repos["cookiecutter-github-control"] is not in configuration)\n  - resource "github_team_repository" "dev" {\n      - etag       = "W/\\"8043f81b19693f6c1a72d21bb8dc03859c98bf78bfbe79782bfe13fa813992ca\\"" -> null\n      - id         = "7332815:cookiecutter-github-control" -> null\n      - permission = "push" -> null\n      - repository = "cookiecutter-github-control" -> null\n      - team_id    = "7332815" -> null\n    }\n\n  # module.repos["infrahouse-toolkit"].github_repository.repo will be updated in-place\n  ~ resource "github_repository" "repo" {\n      ~ description                 = "InfraHouse Toolkit" -> "InfraHouse Toolkit1"\n        id                          = "infrahouse-toolkit"\n        name                        = "infrahouse-toolkit"\n        # (31 unchanged attributes hidden)\n\n        # (1 unchanged block hidden)\n    }\n\n  # module.repos["test"].github_repository.repo will be created\n  + resource "github_repository" "repo" {\n      + allow_auto_merge            = false\n      + allow_merge_commit          = true\n      + allow_rebase_merge          = true\n      + allow_squash_merge          = true\n      + archived                    = false\n      + default_branch              = (known after apply)\n      + delete_branch_on_merge      = false\n      + description                 = "Template for a GitHub Control repository"\n      + etag                        = (known after apply)\n      + full_name                   = (known after apply)\n      + git_clone_url               = (known after apply)\n      + has_issues                  = true\n      + html_url                    = (known after apply)\n      + http_clone_url              = (known after apply)\n      + id                          = (known after apply)\n      + merge_commit_message        = "PR_TITLE"\n      + merge_commit_title          = "MERGE_MESSAGE"\n      + name                        = "test"\n      + node_id                     = (known after apply)\n      + private                     = (known after apply)\n      + repo_id                     = (known after apply)\n      + squash_merge_commit_message = "COMMIT_MESSAGES"\n      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"\n      + ssh_clone_url               = (known after apply)\n      + svn_url                     = (known after apply)\n      + visibility                  = "public"\n\n      + security_and_analysis {\n          + advanced_security {\n              + status = (known after apply)\n            }\n\n          + secret_scanning {\n              + status = (known after apply)\n            }\n\n          + secret_scanning_push_protection {\n              + status = (known after apply)\n            }\n        }\n    }\n\n  # module.repos["test"].github_team_repository.dev will be created\n  + resource "github_team_repository" "dev" {\n      + etag       = (known after apply)\n      + id         = (known after apply)\n      + permission = "push"\n      + repository = "test"\n      + team_id    = "7332815"\n    }\n\nPlan: 2 to add, 1 to change, 2 to destroy.\n\n\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\n\nSaved the plan to: tf.plan\n\nTo perform exactly these actions, run the following command to apply:\n    terraform apply "tf.plan"\n```\n</details>\n<details>\n<summary>STDERR</summary>\n\n```no output```\n</details>\n<details><summary><i>metadata</i></summary>\n<p>\n```eyJzMzovL2Zvb19iYWNrZXQvcGF0aC90by90Zi5zdGF0ZSI6IHsic3VjY2VzcyI6IHRydWUsICJzdGRvdXQiOiAiVGVycmFmb3JtIHVzZWQgdGhlIHNlbGVjdGVkIHByb3ZpZGVycyB0byBnZW5lcmF0ZSB0aGUgZm9sbG93aW5nIGV4ZWN1dGlvblxucGxhbi4gUmVzb3VyY2UgYWN0aW9ucyBhcmUgaW5kaWNhdGVkIHdpdGggdGhlIGZvbGxvd2luZyBzeW1ib2xzOlxuICArIGNyZWF0ZVxuICB+IHVwZGF0ZSBpbi1wbGFjZVxuICAtIGRlc3Ryb3lcblxuVGVycmFmb3JtIHdpbGwgcGVyZm9ybSB0aGUgZm9sbG93aW5nIGFjdGlvbnM6XG5cbiAgIyBtb2R1bGUucmVwb3NbXCJjb29raWVjdXR0ZXItZ2l0aHViLWNvbnRyb2xcIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbyB3aWxsIGJlIGRlc3Ryb3llZFxuICAjIChiZWNhdXNlIG1vZHVsZS5yZXBvc1tcImNvb2tpZWN1dHRlci1naXRodWItY29udHJvbFwiXSBpcyBub3QgaW4gY29uZmlndXJhdGlvbilcbiAgLSByZXNvdXJjZSBcImdpdGh1Yl9yZXBvc2l0b3J5XCIgXCJyZXBvXCIge1xuICAgICAgLSBhbGxvd19hdXRvX21lcmdlICAgICAgICAgICAgPSBmYWxzZSAtPiBudWxsXG4gICAgICAtIGFsbG93X21lcmdlX2NvbW1pdCAgICAgICAgICA9IHRydWUgLT4gbnVsbFxuICAgICAgLSBhbGxvd19yZWJhc2VfbWVyZ2UgICAgICAgICAgPSB0cnVlIC0+IG51bGxcbiAgICAgIC0gYWxsb3dfc3F1YXNoX21lcmdlICAgICAgICAgID0gdHJ1ZSAtPiBudWxsXG4gICAgICAtIGFsbG93X3VwZGF0ZV9icmFuY2ggICAgICAgICA9IGZhbHNlIC0+IG51bGxcbiAgICAgIC0gYXJjaGl2ZWQgICAgICAgICAgICAgICAgICAgID0gZmFsc2UgLT4gbnVsbFxuICAgICAgLSBkZWZhdWx0X2JyYW5jaCAgICAgICAgICAgICAgPSBcIm1haW5cIiAtPiBudWxsXG4gICAgICAtIGRlbGV0ZV9icmFuY2hfb25fbWVyZ2UgICAgICA9IGZhbHNlIC0+IG51bGxcbiAgICAgIC0gZGVzY3JpcHRpb24gICAgICAgICAgICAgICAgID0gXCJUZW1wbGF0ZSBmb3IgYSBHaXRIdWIgQ29udHJvbCByZXBvc2l0b3J5XCIgLT4gbnVsbFxuICAgICAgLSBldGFnICAgICAgICAgICAgICAgICAgICAgICAgPSBcIlcvXFxcIjhiNGE3OTJiYzE0NzRkMzgxY2FhYTYzYjc2NjY4OTkzYjRhZGM0MmFlNzZlZDUzZDY4ODZkODU2MmViYjBjNjdcXFwiXCIgLT4gbnVsbFxuICAgICAgLSBmdWxsX25hbWUgICAgICAgICAgICAgICAgICAgPSBcImluZnJhaG91c2UvY29va2llY3V0dGVyLWdpdGh1Yi1jb250cm9sXCIgLT4gbnVsbFxuICAgICAgLSBnaXRfY2xvbmVfdXJsICAgICAgICAgICAgICAgPSBcImdpdDovL2dpdGh1Yi5jb20vaW5mcmFob3VzZS9jb29raWVjdXR0ZXItZ2l0aHViLWNvbnRyb2wuZ2l0XCIgLT4gbnVsbFxuICAgICAgLSBoYXNfZGlzY3Vzc2lvbnMgICAgICAgICAgICAgPSBmYWxzZSAtPiBudWxsXG4gICAgICAtIGhhc19kb3dubG9hZHMgICAgICAgICAgICAgICA9IGZhbHNlIC0+IG51bGxcbiAgICAgIC0gaGFzX2lzc3VlcyAgICAgICAgICAgICAgICAgID0gdHJ1ZSAtPiBudWxsXG4gICAgICAtIGhhc19wcm9qZWN0cyAgICAgICAgICAgICAgICA9IGZhbHNlIC0+IG51bGxcbiAgICAgIC0gaGFzX3dpa2kgICAgICAgICAgICAgICAgICAgID0gZmFsc2UgLT4gbnVsbFxuICAgICAgLSBodG1sX3VybCAgICAgICAgICAgICAgICAgICAgPSBcImh0dHBzOi8vZ2l0aHViLmNvbS9pbmZyYWhvdXNlL2Nvb2tpZWN1dHRlci1naXRodWItY29udHJvbFwiIC0+IG51bGxcbiAgICAgIC0gaHR0cF9jbG9uZV91cmwgICAgICAgICAgICAgID0gXCJodHRwczovL2dpdGh1Yi5jb20vaW5mcmFob3VzZS9jb29raWVjdXR0ZXItZ2l0aHViLWNvbnRyb2wuZ2l0XCIgLT4gbnVsbFxuICAgICAgLSBpZCAgICAgICAgICAgICAgICAgICAgICAgICAgPSBcImNvb2tpZWN1dHRlci1naXRodWItY29udHJvbFwiIC0+IG51bGxcbiAgICAgIC0gaXNfdGVtcGxhdGUgICAgICAgICAgICAgICAgID0gZmFsc2UgLT4gbnVsbFxuICAgICAgLSBtZXJnZV9jb21taXRfbWVzc2FnZSAgICAgICAgPSBcIlBSX1RJVExFXCIgLT4gbnVsbFxuICAgICAgLSBtZXJnZV9jb21taXRfdGl0bGUgICAgICAgICAgPSBcIk1FUkdFX01FU1NBR0VcIiAtPiBudWxsXG4gICAgICAtIG5hbWUgICAgICAgICAgICAgICAgICAgICAgICA9IFwiY29va2llY3V0dGVyLWdpdGh1Yi1jb250cm9sXCIgLT4gbnVsbFxuICAgICAgLSBub2RlX2lkICAgICAgICAgICAgICAgICAgICAgPSBcIlJfa2dET0k1Mjh6Z1wiIC0+IG51bGxcbiAgICAgIC0gcHJpdmF0ZSAgICAgICAgICAgICAgICAgICAgID0gZmFsc2UgLT4gbnVsbFxuICAgICAgLSByZXBvX2lkICAgICAgICAgICAgICAgICAgICAgPSA1OTc1NDAwNDYgLT4gbnVsbFxuICAgICAgLSBzcXVhc2hfbWVyZ2VfY29tbWl0X21lc3NhZ2UgPSBcIkNPTU1JVF9NRVNTQUdFU1wiIC0+IG51bGxcbiAgICAgIC0gc3F1YXNoX21lcmdlX2NvbW1pdF90aXRsZSAgID0gXCJDT01NSVRfT1JfUFJfVElUTEVcIiAtPiBudWxsXG4gICAgICAtIHNzaF9jbG9uZV91cmwgICAgICAgICAgICAgICA9IFwiZ2l0QGdpdGh1Yi5jb206aW5mcmFob3VzZS9jb29raWVjdXR0ZXItZ2l0aHViLWNvbnRyb2wuZ2l0XCIgLT4gbnVsbFxuICAgICAgLSBzdm5fdXJsICAgICAgICAgICAgICAgICAgICAgPSBcImh0dHBzOi8vZ2l0aHViLmNvbS9pbmZyYWhvdXNlL2Nvb2tpZWN1dHRlci1naXRodWItY29udHJvbFwiIC0+IG51bGxcbiAgICAgIC0gdG9waWNzICAgICAgICAgICAgICAgICAgICAgID0gW10gLT4gbnVsbFxuICAgICAgLSB2aXNpYmlsaXR5ICAgICAgICAgICAgICAgICAgPSBcInB1YmxpY1wiIC0+IG51bGxcbiAgICAgIC0gdnVsbmVyYWJpbGl0eV9hbGVydHMgICAgICAgID0gZmFsc2UgLT4gbnVsbFxuXG4gICAgICAtIHNlY3VyaXR5X2FuZF9hbmFseXNpcyB7XG5cbiAgICAgICAgICAtIHNlY3JldF9zY2FubmluZyB7XG4gICAgICAgICAgICAgIC0gc3RhdHVzID0gXCJkaXNhYmxlZFwiIC0+IG51bGxcbiAgICAgICAgICAgIH1cblxuICAgICAgICAgIC0gc2VjcmV0X3NjYW5uaW5nX3B1c2hfcHJvdGVjdGlvbiB7XG4gICAgICAgICAgICAgIC0gc3RhdHVzID0gXCJkaXNhYmxlZFwiIC0+IG51bGxcbiAgICAgICAgICAgIH1cbiAgICAgICAgfVxuICAgIH1cblxuICAjIG1vZHVsZS5yZXBvc1tcImNvb2tpZWN1dHRlci1naXRodWItY29udHJvbFwiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldiB3aWxsIGJlIGRlc3Ryb3llZFxuICAjIChiZWNhdXNlIG1vZHVsZS5yZXBvc1tcImNvb2tpZWN1dHRlci1naXRodWItY29udHJvbFwiXSBpcyBub3QgaW4gY29uZmlndXJhdGlvbilcbiAgLSByZXNvdXJjZSBcImdpdGh1Yl90ZWFtX3JlcG9zaXRvcnlcIiBcImRldlwiIHtcbiAgICAgIC0gZXRhZyAgICAgICA9IFwiVy9cXFwiODA0M2Y4MWIxOTY5M2Y2YzFhNzJkMjFiYjhkYzAzODU5Yzk4YmY3OGJmYmU3OTc4MmJmZTEzZmE4MTM5OTJjYVxcXCJcIiAtPiBudWxsXG4gICAgICAtIGlkICAgICAgICAgPSBcIjczMzI4MTU6Y29va2llY3V0dGVyLWdpdGh1Yi1jb250cm9sXCIgLT4gbnVsbFxuICAgICAgLSBwZXJtaXNzaW9uID0gXCJwdXNoXCIgLT4gbnVsbFxuICAgICAgLSByZXBvc2l0b3J5ID0gXCJjb29raWVjdXR0ZXItZ2l0aHViLWNvbnRyb2xcIiAtPiBudWxsXG4gICAgICAtIHRlYW1faWQgICAgPSBcIjczMzI4MTVcIiAtPiBudWxsXG4gICAgfVxuXG4gICMgbW9kdWxlLnJlcG9zW1wiaW5mcmFob3VzZS10b29sa2l0XCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG8gd2lsbCBiZSB1cGRhdGVkIGluLXBsYWNlXG4gIH4gcmVzb3VyY2UgXCJnaXRodWJfcmVwb3NpdG9yeVwiIFwicmVwb1wiIHtcbiAgICAgIH4gZGVzY3JpcHRpb24gICAgICAgICAgICAgICAgID0gXCJJbmZyYUhvdXNlIFRvb2xraXRcIiAtPiBcIkluZnJhSG91c2UgVG9vbGtpdDFcIlxuICAgICAgICBpZCAgICAgICAgICAgICAgICAgICAgICAgICAgPSBcImluZnJhaG91c2UtdG9vbGtpdFwiXG4gICAgICAgIG5hbWUgICAgICAgICAgICAgICAgICAgICAgICA9IFwiaW5mcmFob3VzZS10b29sa2l0XCJcbiAgICAgICAgIyAoMzEgdW5jaGFuZ2VkIGF0dHJpYnV0ZXMgaGlkZGVuKVxuXG4gICAgICAgICMgKDEgdW5jaGFuZ2VkIGJsb2NrIGhpZGRlbilcbiAgICB9XG5cbiAgIyBtb2R1bGUucmVwb3NbXCJ0ZXN0XCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG8gd2lsbCBiZSBjcmVhdGVkXG4gICsgcmVzb3VyY2UgXCJnaXRodWJfcmVwb3NpdG9yeVwiIFwicmVwb1wiIHtcbiAgICAgICsgYWxsb3dfYXV0b19tZXJnZSAgICAgICAgICAgID0gZmFsc2VcbiAgICAgICsgYWxsb3dfbWVyZ2VfY29tbWl0ICAgICAgICAgID0gdHJ1ZVxuICAgICAgKyBhbGxvd19yZWJhc2VfbWVyZ2UgICAgICAgICAgPSB0cnVlXG4gICAgICArIGFsbG93X3NxdWFzaF9tZXJnZSAgICAgICAgICA9IHRydWVcbiAgICAgICsgYXJjaGl2ZWQgICAgICAgICAgICAgICAgICAgID0gZmFsc2VcbiAgICAgICsgZGVmYXVsdF9icmFuY2ggICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBkZWxldGVfYnJhbmNoX29uX21lcmdlICAgICAgPSBmYWxzZVxuICAgICAgKyBkZXNjcmlwdGlvbiAgICAgICAgICAgICAgICAgPSBcIlRlbXBsYXRlIGZvciBhIEdpdEh1YiBDb250cm9sIHJlcG9zaXRvcnlcIlxuICAgICAgKyBldGFnICAgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGZ1bGxfbmFtZSAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgZ2l0X2Nsb25lX3VybCAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBoYXNfaXNzdWVzICAgICAgICAgICAgICAgICAgPSB0cnVlXG4gICAgICArIGh0bWxfdXJsICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgaHR0cF9jbG9uZV91cmwgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBpZCAgICAgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIG1lcmdlX2NvbW1pdF9tZXNzYWdlICAgICAgICA9IFwiUFJfVElUTEVcIlxuICAgICAgKyBtZXJnZV9jb21taXRfdGl0bGUgICAgICAgICAgPSBcIk1FUkdFX01FU1NBR0VcIlxuICAgICAgKyBuYW1lICAgICAgICAgICAgICAgICAgICAgICAgPSBcInRlc3RcIlxuICAgICAgKyBub2RlX2lkICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHByaXZhdGUgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgcmVwb19pZCAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBzcXVhc2hfbWVyZ2VfY29tbWl0X21lc3NhZ2UgPSBcIkNPTU1JVF9NRVNTQUdFU1wiXG4gICAgICArIHNxdWFzaF9tZXJnZV9jb21taXRfdGl0bGUgICA9IFwiQ09NTUlUX09SX1BSX1RJVExFXCJcbiAgICAgICsgc3NoX2Nsb25lX3VybCAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBzdm5fdXJsICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHZpc2liaWxpdHkgICAgICAgICAgICAgICAgICA9IFwicHVibGljXCJcblxuICAgICAgKyBzZWN1cml0eV9hbmRfYW5hbHlzaXMge1xuICAgICAgICAgICsgYWR2YW5jZWRfc2VjdXJpdHkge1xuICAgICAgICAgICAgICArIHN0YXR1cyA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICAgICAgIH1cblxuICAgICAgICAgICsgc2VjcmV0X3NjYW5uaW5nIHtcbiAgICAgICAgICAgICAgKyBzdGF0dXMgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICAgICAgICB9XG5cbiAgICAgICAgICArIHNlY3JldF9zY2FubmluZ19wdXNoX3Byb3RlY3Rpb24ge1xuICAgICAgICAgICAgICArIHN0YXR1cyA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICAgICAgIH1cbiAgICAgICAgfVxuICAgIH1cblxuICAjIG1vZHVsZS5yZXBvc1tcInRlc3RcIl0uZ2l0aHViX3RlYW1fcmVwb3NpdG9yeS5kZXYgd2lsbCBiZSBjcmVhdGVkXG4gICsgcmVzb3VyY2UgXCJnaXRodWJfdGVhbV9yZXBvc2l0b3J5XCIgXCJkZXZcIiB7XG4gICAgICArIGV0YWcgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGlkICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHBlcm1pc3Npb24gPSBcInB1c2hcIlxuICAgICAgKyByZXBvc2l0b3J5ID0gXCJ0ZXN0XCJcbiAgICAgICsgdGVhbV9pZCAgICA9IFwiNzMzMjgxNVwiXG4gICAgfVxuXG5QbGFuOiAyIHRvIGFkZCwgMSB0byBjaGFuZ2UsIDIgdG8gZGVzdHJveS5cblxuXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXG5cblNhdmVkIHRoZSBwbGFuIHRvOiB0Zi5wbGFuXG5cblRvIHBlcmZvcm0gZXhhY3RseSB0aGVzZSBhY3Rpb25zLCBydW4gdGhlIGZvbGxvd2luZyBjb21tYW5kIHRvIGFwcGx5OlxuICAgIHRlcnJhZm9ybSBhcHBseSBcInRmLnBsYW5cIiIsICJzdGRlcnIiOiBudWxsLCAiYWRkIjogMiwgImNoYW5nZSI6IDEsICJkZXN0cm95IjogMn19```\n</p></details>] PASSED
infrahouse_toolkit/terraform/tests/status/test_comment.py::test_comment_none 
# State **`s3://foo_backet/path/to/tf.state`**
## Affected resources counts

|  Success  |  Add   |  Change   |  Destroy   |
|:---------:|:-------|:----------|:-----------|
|     ✅     | ❔      | ❔         | ❔          |
## Affected resources by action

No affected resources
<details>
<summary>STDOUT</summary>

```
no stdout
```
</details>
<details>
<summary>STDERR</summary>

```no stderr```
</details>
<details><summary><i>metadata</i></summary>
<p>
```eyJzMzovL2Zvb19iYWNrZXQvcGF0aC90by90Zi5zdGF0ZSI6IHsic3VjY2VzcyI6IHRydWUsICJzdGRvdXQiOiAibm8gc3Rkb3V0IiwgInN0ZGVyciI6ICJubyBzdGRlcnIiLCAiYWRkIjogbnVsbCwgImNoYW5nZSI6IG51bGwsICJkZXN0cm95IjogbnVsbH19```
</p></details>
PASSED
infrahouse_toolkit/terraform/tests/status/test_eq.py::test_eq PASSED
infrahouse_toolkit/terraform/tests/status/test_eq.py::test_eq_no_affrected_res PASSED
infrahouse_toolkit/terraform/tests/status/test_eq.py::test_neq PASSED
infrahouse_toolkit/terraform/tests/status/test_metadata.py::test_metadata PASSED
infrahouse_toolkit/terraform/tests/status/test_metadata.py::test_metadata_none_outputs PASSED
infrahouse_toolkit/terraform/tests/status/test_summary_counts.py::test_summary_counts 
|  Success  |   🟢 Add |   🟡 Change |   🔴 Destroy |
|:---------:|--------:|-----------:|------------:|
|     ✅     |       1 |          1 |           1 |

|  Success  |  Add   |  Change   |  Destroy   |
|:---------:|:-------|:----------|:-----------|
|     ❌     | ❔      | ❔         | ❔          |
PASSED
infrahouse_toolkit/terraform/tests/status/test_summary_counts.py::test_summary_counts_none 
|  Success  |  Add   |  Change   |  Destroy   |
|:---------:|:-------|:----------|:-----------|
|     ✅     | ❔      | ❔         | ❔          |
PASSED
infrahouse_toolkit/terraform/tests/status/test_summary_resources.py::test_summary_resources 

PASSED
infrahouse_toolkit/tests/test_timeout.py::test_timeout PASSED

----------- coverage: platform linux, python 3.9.5-final-0 -----------
Name                                                                                         Stmts   Miss  Cover   Missing
--------------------------------------------------------------------------------------------------------------------------
infrahouse_toolkit/__init__.py                                                                   5      0   100%
infrahouse_toolkit/aws/__init__.py                                                              44     31    30%   27-37, 55-95
infrahouse_toolkit/aws/config.py                                                                35      4    89%   57, 61, 65-66
infrahouse_toolkit/aws/exceptions.py                                                             2      0   100%
infrahouse_toolkit/aws/tests/__init__.py                                                         0      0   100%
infrahouse_toolkit/aws/tests/config/__init__.py                                                  0      0   100%
infrahouse_toolkit/aws/tests/config/test_aws_home.py                                             6      0   100%
infrahouse_toolkit/aws/tests/config/test_get_account_id.py                                      10      0   100%
infrahouse_toolkit/aws/tests/config/test_profiles.py                                             9      0   100%
infrahouse_toolkit/cli/__init__.py                                                               0      0   100%
infrahouse_toolkit/cli/ih_plan/__init__.py                                                      17      0   100%
infrahouse_toolkit/cli/ih_plan/cmd_download/__init__.py                                         14      6    57%   28-33
infrahouse_toolkit/cli/ih_plan/cmd_min_permissions/__init__.py                                  72      1    99%   176
infrahouse_toolkit/cli/ih_plan/cmd_min_permissions/tests/__init__.py                             0      0   100%
infrahouse_toolkit/cli/ih_plan/cmd_min_permissions/tests/actionlist/__init__.py                  0      0   100%
infrahouse_toolkit/cli/ih_plan/cmd_min_permissions/tests/actionlist/test_actions.py              3      0   100%
infrahouse_toolkit/cli/ih_plan/cmd_min_permissions/tests/actionlist/test_add.py                 29      0   100%
infrahouse_toolkit/cli/ih_plan/cmd_min_permissions/tests/actionlist/test_load_from_file.py       8      0   100%
infrahouse_toolkit/cli/ih_plan/cmd_min_permissions/tests/actionlist/test_parse_trace.py         17      0   100%
infrahouse_toolkit/cli/ih_plan/cmd_min_permissions/tests/test_min_permissions.py                26      0   100%
infrahouse_toolkit/cli/ih_plan/cmd_publish/__init__.py                                          28     12    57%   52-77
infrahouse_toolkit/cli/ih_plan/cmd_remove/__init__.py                                           15      8    47%   16-20, 36-39
infrahouse_toolkit/cli/ih_plan/cmd_upload/__init__.py                                           13      5    62%   31-35
infrahouse_toolkit/cli/lib.py                                                                   29     17    41%   33-35, 46-57, 71-79
infrahouse_toolkit/cli/tests/__init__.py                                                         0      0   100%
infrahouse_toolkit/cli/tests/conftest.py                                                         7      0   100%
infrahouse_toolkit/cli/tests/test_get_bucket.py                                                  3      0   100%
infrahouse_toolkit/exceptions.py                                                                 1      0   100%
infrahouse_toolkit/lock/__init__.py                                                              0      0   100%
infrahouse_toolkit/lock/base.py                                                                 12      3    75%   19, 24, 29
infrahouse_toolkit/lock/exceptions.py                                                            2      0   100%
infrahouse_toolkit/lock/system.py                                                               19      0   100%
infrahouse_toolkit/lock/tests/__init__.py                                                        0      0   100%
infrahouse_toolkit/lock/tests/test_system_lock.py                                               18      0   100%
infrahouse_toolkit/terraform/__init__.py                                                        88     35    60%   61, 114-115, 150-178, 202-206, 232-244
infrahouse_toolkit/terraform/backends/__init__.py                                                9      0   100%
infrahouse_toolkit/terraform/backends/exceptions.py                                              3      0   100%
infrahouse_toolkit/terraform/backends/s3backend.py                                              28      3    89%   43-44, 47
infrahouse_toolkit/terraform/backends/tests/__init__.py                                          0      0   100%
infrahouse_toolkit/terraform/backends/tests/s3backend/__init__.py                                0      0   100%
infrahouse_toolkit/terraform/backends/tests/s3backend/test_eq.py                                 4      0   100%
infrahouse_toolkit/terraform/backends/tests/s3backend/test_init.py                               3      0   100%
infrahouse_toolkit/terraform/backends/tests/s3backend/test_region.py                            10      1    90%   21
infrahouse_toolkit/terraform/backends/tests/test_get_backend.py                                  7      0   100%
infrahouse_toolkit/terraform/backends/tfbackend.py                                               5      0   100%
infrahouse_toolkit/terraform/exceptions.py                                                       3      0   100%
infrahouse_toolkit/terraform/githubpr.py                                                        62     14    77%   96-98, 105-119, 139, 142-143
infrahouse_toolkit/terraform/status.py                                                          68      0   100%
infrahouse_toolkit/terraform/tests/__init__.py                                                   0      0   100%
infrahouse_toolkit/terraform/tests/github_pr/__init__.py                                         0      0   100%
infrahouse_toolkit/terraform/tests/github_pr/test_find_comment_by_backend.py                    19      0   100%
infrahouse_toolkit/terraform/tests/github_pr/test_init.py                                        8      0   100%
infrahouse_toolkit/terraform/tests/github_pr/test_publish_comment.py                            26      0   100%
infrahouse_toolkit/terraform/tests/github_pr/test_publish_gist.py                                9      0   100%
infrahouse_toolkit/terraform/tests/status/__init__.py                                            0      0   100%
infrahouse_toolkit/terraform/tests/status/test_comment.py                                       14      0   100%
infrahouse_toolkit/terraform/tests/status/test_eq.py                                             8      0   100%
infrahouse_toolkit/terraform/tests/status/test_metadata.py                                      18      0   100%
infrahouse_toolkit/terraform/tests/status/test_summary_counts.py                                14      0   100%
infrahouse_toolkit/terraform/tests/status/test_summary_resources.py                              9      0   100%
infrahouse_toolkit/terraform/tests/test_parse_comment.py                                        15      0   100%
infrahouse_toolkit/terraform/tests/test_parse_plan.py                                           10      0   100%
infrahouse_toolkit/tests/__init__.py                                                             0      0   100%
infrahouse_toolkit/tests/test_timeout.py                                                         7      0   100%
infrahouse_toolkit/timeout.py                                                                   13      0   100%
--------------------------------------------------------------------------------------------------------------------------
TOTAL                                                                                          904    140    85%
Coverage XML written to file coverage.xml


============================= 75 passed in 13.42s ==============================

```
**Standard error**:
```
No output
```
